/**
 *  工具类库
 */

if (!String.prototype.format) {
	String.prototype.format = function () {
		var args = arguments;
		return this.replace(/{(\d+)}/g, function (match, number) {
			return typeof args[number] != 'undefined' ? args[number] : match;
		});
	}
}

window.area = {
	"11": {
		"name": "北京市",
		"content": {
			"01": {
				"name": "北京市",
				"content": {
					"11": {"name": "房山区"},
					"12": {"name": "通州区"},
					"13": {"name": "顺义区"},
					"14": {"name": "昌平区"},
					"15": {"name": "大兴区"},
					"16": {"name": "怀柔区"},
					"17": {"name": "平谷区"},
					"18": {"name": "密云县"},
					"19": {"name": "延庆县"},
					"01": {"name": "东城区"},
					"02": {"name": "西城区"},
					"03": {"name": "崇文区"},
					"04": {"name": "宣武区"},
					"05": {"name": "朝阳区"},
					"06": {"name": "丰台区"},
					"07": {"name": "石景山区"},
					"08": {"name": "海淀区"},
					"09": {"name": "门头沟区"}
				}
			}
		}
	},
	"12": {
		"name": "天津市",
		"content": {
			"01": {
				"name": "天津市",
				"content": {
					"10": {"name": "东丽区"},
					"11": {"name": "西青区"},
					"12": {"name": "津南区"},
					"13": {"name": "北辰区"},
					"14": {"name": "武清区"},
					"15": {"name": "宝坻区"},
					"16": {"name": "宁河县"},
					"17": {"name": "静海县"},
					"18": {"name": "蓟　县"},
					"01": {"name": "和平区"},
					"02": {"name": "河东区"},
					"03": {"name": "河西区"},
					"04": {"name": "南开区"},
					"05": {"name": "河北区"},
					"06": {"name": "红桥区"},
					"07": {"name": "塘沽区"},
					"08": {"name": "汉沽区"},
					"09": {"name": "大港区"}
				}
			}
		}
	},
	"13": {
		"name": "河北省",
		"content": {
			"10": {
				"name": "廊坊市",
				"content": {
					"22": {"name": "固安县"},
					"23": {"name": "永清县"},
					"24": {"name": "香河县"},
					"25": {"name": "大城县"},
					"26": {"name": "文安县"},
					"28": {"name": "大厂回族自治县"},
					"81": {"name": "霸州市"},
					"82": {"name": "三河市"},
					"01": {"name": "市辖区"},
					"02": {"name": "安次区"},
					"03": {"name": "广阳区"}
				}
			},
			"11": {
				"name": "衡水市",
				"content": {
					"21": {"name": "枣强县"},
					"22": {"name": "武邑县"},
					"23": {"name": "武强县"},
					"24": {"name": "饶阳县"},
					"25": {"name": "安平县"},
					"26": {"name": "故城县"},
					"27": {"name": "景　县"},
					"28": {"name": "阜城县"},
					"81": {"name": "冀州市"},
					"82": {"name": "深州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "桃城区"}
				}
			},
			"01": {
				"name": "石家庄市",
				"content": {
					"21": {"name": "井陉县"},
					"23": {"name": "正定县"},
					"24": {"name": "栾城县"},
					"25": {"name": "行唐县"},
					"26": {"name": "灵寿县"},
					"27": {"name": "高邑县"},
					"28": {"name": "深泽县"},
					"29": {"name": "赞皇县"},
					"30": {"name": "无极县"},
					"31": {"name": "平山县"},
					"32": {"name": "元氏县"},
					"33": {"name": "赵　县"},
					"81": {"name": "辛集市"},
					"82": {"name": "藁城市"},
					"83": {"name": "晋州市"},
					"84": {"name": "新乐市"},
					"85": {"name": "鹿泉市"},
					"01": {"name": "市辖区"},
					"02": {"name": "长安区"},
					"03": {"name": "桥东区"},
					"04": {"name": "桥西区"},
					"05": {"name": "新华区"},
					"07": {"name": "井陉矿区"},
					"08": {"name": "裕华区"}
				}
			},
			"02": {
				"name": "唐山市",
				"content": {
					"23": {"name": "滦　县"},
					"24": {"name": "滦南县"},
					"25": {"name": "乐亭县"},
					"27": {"name": "迁西县"},
					"29": {"name": "玉田县"},
					"30": {"name": "唐海县"},
					"81": {"name": "遵化市"},
					"83": {"name": "迁安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "路南区"},
					"03": {"name": "路北区"},
					"04": {"name": "古冶区"},
					"05": {"name": "开平区"},
					"07": {"name": "丰南区"},
					"08": {"name": "丰润区"}
				}
			},
			"03": {
				"name": "秦皇岛市",
				"content": {
					"21": {"name": "青龙满族自治县"},
					"22": {"name": "昌黎县"},
					"23": {"name": "抚宁县"},
					"24": {"name": "卢龙县"},
					"01": {"name": "市辖区"},
					"02": {"name": "海港区"},
					"03": {"name": "山海关区"},
					"04": {"name": "北戴河区"}
				}
			},
			"04": {
				"name": "邯郸市",
				"content": {
					"21": {"name": "邯郸县"},
					"23": {"name": "临漳县"},
					"24": {"name": "成安县"},
					"25": {"name": "大名县"},
					"26": {"name": "涉　县"},
					"27": {"name": "磁　县"},
					"28": {"name": "肥乡县"},
					"29": {"name": "永年县"},
					"30": {"name": "邱　县"},
					"31": {"name": "鸡泽县"},
					"32": {"name": "广平县"},
					"33": {"name": "馆陶县"},
					"34": {"name": "魏　县"},
					"35": {"name": "曲周县"},
					"81": {"name": "武安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "邯山区"},
					"03": {"name": "丛台区"},
					"04": {"name": "复兴区"},
					"06": {"name": "峰峰矿区"}
				}
			},
			"05": {
				"name": "邢台市",
				"content": {
					"21": {"name": "邢台县"},
					"22": {"name": "临城县"},
					"23": {"name": "内丘县"},
					"24": {"name": "柏乡县"},
					"25": {"name": "隆尧县"},
					"26": {"name": "任　县"},
					"27": {"name": "南和县"},
					"28": {"name": "宁晋县"},
					"29": {"name": "巨鹿县"},
					"30": {"name": "新河县"},
					"31": {"name": "广宗县"},
					"32": {"name": "平乡县"},
					"33": {"name": "威　县"},
					"34": {"name": "清河县"},
					"35": {"name": "临西县"},
					"81": {"name": "南宫市"},
					"82": {"name": "沙河市"},
					"01": {"name": "市辖区"},
					"02": {"name": "桥东区"},
					"03": {"name": "桥西区"}
				}
			},
			"06": {
				"name": "保定市",
				"content": {
					"21": {"name": "满城县"},
					"22": {"name": "清苑县"},
					"23": {"name": "涞水县"},
					"24": {"name": "阜平县"},
					"25": {"name": "徐水县"},
					"26": {"name": "定兴县"},
					"27": {"name": "唐　县"},
					"28": {"name": "高阳县"},
					"29": {"name": "容城县"},
					"30": {"name": "涞源县"},
					"31": {"name": "望都县"},
					"32": {"name": "安新县"},
					"33": {"name": "易　县"},
					"34": {"name": "曲阳县"},
					"35": {"name": "蠡　县"},
					"36": {"name": "顺平县"},
					"37": {"name": "博野县"},
					"38": {"name": "雄　县"},
					"81": {"name": "涿州市"},
					"82": {"name": "定州市"},
					"83": {"name": "安国市"},
					"84": {"name": "高碑店市"},
					"01": {"name": "市辖区"},
					"02": {"name": "新市区"},
					"03": {"name": "北市区"},
					"04": {"name": "南市区"}
				}
			},
			"07": {
				"name": "张家口市",
				"content": {
					"21": {"name": "宣化县"},
					"22": {"name": "张北县"},
					"23": {"name": "康保县"},
					"24": {"name": "沽源县"},
					"25": {"name": "尚义县"},
					"26": {"name": "蔚　县"},
					"27": {"name": "阳原县"},
					"28": {"name": "怀安县"},
					"29": {"name": "万全县"},
					"30": {"name": "怀来县"},
					"31": {"name": "涿鹿县"},
					"32": {"name": "赤城县"},
					"33": {"name": "崇礼县"},
					"01": {"name": "市辖区"},
					"02": {"name": "桥东区"},
					"03": {"name": "桥西区"},
					"05": {"name": "宣化区"},
					"06": {"name": "下花园区"}
				}
			},
			"08": {
				"name": "承德市",
				"content": {
					"21": {"name": "承德县"},
					"22": {"name": "兴隆县"},
					"23": {"name": "平泉县"},
					"24": {"name": "滦平县"},
					"25": {"name": "隆化县"},
					"26": {"name": "丰宁满族自治县"},
					"27": {"name": "宽城满族自治县"},
					"28": {"name": "围场满族蒙古族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "双桥区"},
					"03": {"name": "双滦区"},
					"04": {"name": "鹰手营子矿区"}
				}
			},
			"09": {
				"name": "沧州市",
				"content": {
					"21": {"name": "沧　县"},
					"22": {"name": "青　县"},
					"23": {"name": "东光县"},
					"24": {"name": "海兴县"},
					"25": {"name": "盐山县"},
					"26": {"name": "肃宁县"},
					"27": {"name": "南皮县"},
					"28": {"name": "吴桥县"},
					"29": {"name": "献　县"},
					"30": {"name": "孟村回族自治县"},
					"81": {"name": "泊头市"},
					"82": {"name": "任丘市"},
					"83": {"name": "黄骅市"},
					"84": {"name": "河间市"},
					"01": {"name": "市辖区"},
					"02": {"name": "新华区"},
					"03": {"name": "运河区"}
				}
			}
		}
	},
	"14": {
		"name": "山西省",
		"content": {
			"10": {
				"name": "临汾市",
				"content": {
					"21": {"name": "曲沃县"},
					"22": {"name": "翼城县"},
					"23": {"name": "襄汾县"},
					"24": {"name": "洪洞县"},
					"25": {"name": "古　县"},
					"26": {"name": "安泽县"},
					"27": {"name": "浮山县"},
					"28": {"name": "吉　县"},
					"29": {"name": "乡宁县"},
					"30": {"name": "大宁县"},
					"31": {"name": "隰　县"},
					"32": {"name": "永和县"},
					"33": {"name": "蒲　县"},
					"34": {"name": "汾西县"},
					"81": {"name": "侯马市"},
					"82": {"name": "霍州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "尧都区"}
				}
			},
			"11": {
				"name": "吕梁市",
				"content": {
					"21": {"name": "文水县"},
					"22": {"name": "交城县"},
					"23": {"name": "兴　县"},
					"24": {"name": "临　县"},
					"25": {"name": "柳林县"},
					"26": {"name": "石楼县"},
					"27": {"name": "岚　县"},
					"28": {"name": "方山县"},
					"29": {"name": "中阳县"},
					"30": {"name": "交口县"},
					"81": {"name": "孝义市"},
					"82": {"name": "汾阳市"},
					"01": {"name": "市辖区"},
					"02": {"name": "离石区"}
				}
			},
			"01": {
				"name": "太原市",
				"content": {
					"10": {"name": "晋源区"},
					"21": {"name": "清徐县"},
					"22": {"name": "阳曲县"},
					"23": {"name": "娄烦县"},
					"81": {"name": "古交市"},
					"01": {"name": "市辖区"},
					"05": {"name": "小店区"},
					"06": {"name": "迎泽区"},
					"07": {"name": "杏花岭区"},
					"08": {"name": "尖草坪区"},
					"09": {"name": "万柏林区"}
				}
			},
			"02": {
				"name": "大同市",
				"content": {
					"11": {"name": "南郊区"},
					"12": {"name": "新荣区"},
					"21": {"name": "阳高县"},
					"22": {"name": "天镇县"},
					"23": {"name": "广灵县"},
					"24": {"name": "灵丘县"},
					"25": {"name": "浑源县"},
					"26": {"name": "左云县"},
					"27": {"name": "大同县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城　区"},
					"03": {"name": "矿　区"}
				}
			},
			"03": {
				"name": "阳泉市",
				"content": {
					"11": {"name": "郊　区"},
					"21": {"name": "平定县"},
					"22": {"name": "盂　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城　区"},
					"03": {"name": "矿　区"}
				}
			},
			"04": {
				"name": "长治市",
				"content": {
					"11": {"name": "郊　区"},
					"21": {"name": "长治县"},
					"23": {"name": "襄垣县"},
					"24": {"name": "屯留县"},
					"25": {"name": "平顺县"},
					"26": {"name": "黎城县"},
					"27": {"name": "壶关县"},
					"28": {"name": "长子县"},
					"29": {"name": "武乡县"},
					"30": {"name": "沁　县"},
					"31": {"name": "沁源县"},
					"81": {"name": "潞城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "城　区"}
				}
			},
			"05": {
				"name": "晋城市",
				"content": {
					"21": {"name": "沁水县"},
					"22": {"name": "阳城县"},
					"24": {"name": "陵川县"},
					"25": {"name": "泽州县"},
					"81": {"name": "高平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "城　区"}
				}
			},
			"06": {
				"name": "朔州市",
				"content": {
					"21": {"name": "山阴县"},
					"22": {"name": "应　县"},
					"23": {"name": "右玉县"},
					"24": {"name": "怀仁县"},
					"01": {"name": "市辖区"},
					"02": {"name": "朔城区"},
					"03": {"name": "平鲁区"}
				}
			},
			"07": {
				"name": "晋中市",
				"content": {
					"21": {"name": "榆社县"},
					"22": {"name": "左权县"},
					"23": {"name": "和顺县"},
					"24": {"name": "昔阳县"},
					"25": {"name": "寿阳县"},
					"26": {"name": "太谷县"},
					"27": {"name": "祁　县"},
					"28": {"name": "平遥县"},
					"29": {"name": "灵石县"},
					"81": {"name": "介休市"},
					"01": {"name": "市辖区"},
					"02": {"name": "榆次区"}
				}
			},
			"08": {
				"name": "运城市",
				"content": {
					"21": {"name": "临猗县"},
					"22": {"name": "万荣县"},
					"23": {"name": "闻喜县"},
					"24": {"name": "稷山县"},
					"25": {"name": "新绛县"},
					"26": {"name": "绛　县"},
					"27": {"name": "垣曲县"},
					"28": {"name": "夏　县"},
					"29": {"name": "平陆县"},
					"30": {"name": "芮城县"},
					"81": {"name": "永济市"},
					"82": {"name": "河津市"},
					"01": {"name": "市辖区"},
					"02": {"name": "盐湖区"}
				}
			},
			"09": {
				"name": "忻州市",
				"content": {
					"21": {"name": "定襄县"},
					"22": {"name": "五台县"},
					"23": {"name": "代　县"},
					"24": {"name": "繁峙县"},
					"25": {"name": "宁武县"},
					"26": {"name": "静乐县"},
					"27": {"name": "神池县"},
					"28": {"name": "五寨县"},
					"29": {"name": "岢岚县"},
					"30": {"name": "河曲县"},
					"31": {"name": "保德县"},
					"32": {"name": "偏关县"},
					"81": {"name": "原平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "忻府区"}
				}
			}
		}
	},
	"15": {
		"name": "内蒙古",
		"content": {
			"22": {
				"name": "兴安盟",
				"content": {
					"21": {"name": "科尔沁右翼前旗"},
					"22": {"name": "科尔沁右翼中旗"},
					"23": {"name": "扎赉特旗"},
					"24": {"name": "突泉县"},
					"01": {"name": "乌兰浩特市"},
					"02": {"name": "阿尔山市"}
				}
			},
			"25": {
				"name": "锡林郭勒盟",
				"content": {
					"22": {"name": "阿巴嘎旗"},
					"23": {"name": "苏尼特左旗"},
					"24": {"name": "苏尼特右旗"},
					"25": {"name": "东乌珠穆沁旗"},
					"26": {"name": "西乌珠穆沁旗"},
					"27": {"name": "太仆寺旗"},
					"28": {"name": "镶黄旗"},
					"29": {"name": "正镶白旗"},
					"30": {"name": "正蓝旗"},
					"31": {"name": "多伦县"},
					"01": {"name": "二连浩特市"},
					"02": {"name": "锡林浩特市"}
				}
			},
			"29": {"name": "阿拉善盟", "content": {"21": {"name": "阿拉善左旗"}, "22": {"name": "阿拉善右旗"}, "23": {"name": "额济纳旗"}}},
			"01": {
				"name": "呼和浩特市",
				"content": {
					"21": {"name": "土默特左旗"},
					"22": {"name": "托克托县"},
					"23": {"name": "和林格尔县"},
					"24": {"name": "清水河县"},
					"25": {"name": "武川县"},
					"01": {"name": "市辖区"},
					"02": {"name": "新城区"},
					"03": {"name": "回民区"},
					"04": {"name": "玉泉区"},
					"05": {"name": "赛罕区"}
				}
			},
			"02": {
				"name": "包头市",
				"content": {
					"21": {"name": "土默特右旗"},
					"22": {"name": "固阳县"},
					"23": {"name": "达尔罕茂明安联合旗"},
					"01": {"name": "市辖区"},
					"02": {"name": "东河区"},
					"03": {"name": "昆都仑区"},
					"04": {"name": "青山区"},
					"05": {"name": "石拐区"},
					"06": {"name": "白云矿区"},
					"07": {"name": "九原区"}
				}
			},
			"03": {
				"name": "乌海市",
				"content": {"01": {"name": "市辖区"}, "02": {"name": "海勃湾区"}, "03": {"name": "海南区"}, "04": {"name": "乌达区"}}
			},
			"04": {
				"name": "赤峰市",
				"content": {
					"21": {"name": "阿鲁科尔沁旗"},
					"22": {"name": "巴林左旗"},
					"23": {"name": "巴林右旗"},
					"24": {"name": "林西县"},
					"25": {"name": "克什克腾旗"},
					"26": {"name": "翁牛特旗"},
					"28": {"name": "喀喇沁旗"},
					"29": {"name": "宁城县"},
					"30": {"name": "敖汉旗"},
					"01": {"name": "市辖区"},
					"02": {"name": "红山区"},
					"03": {"name": "元宝山区"},
					"04": {"name": "松山区"}
				}
			},
			"05": {
				"name": "通辽市",
				"content": {
					"21": {"name": "科尔沁左翼中旗"},
					"22": {"name": "科尔沁左翼后旗"},
					"23": {"name": "开鲁县"},
					"24": {"name": "库伦旗"},
					"25": {"name": "奈曼旗"},
					"26": {"name": "扎鲁特旗"},
					"81": {"name": "霍林郭勒市"},
					"01": {"name": "市辖区"},
					"02": {"name": "科尔沁区"}
				}
			},
			"06": {
				"name": "鄂尔多斯市",
				"content": {
					"21": {"name": "达拉特旗"},
					"22": {"name": "准格尔旗"},
					"23": {"name": "鄂托克前旗"},
					"24": {"name": "鄂托克旗"},
					"25": {"name": "杭锦旗"},
					"26": {"name": "乌审旗"},
					"27": {"name": "伊金霍洛旗"},
					"02": {"name": "东胜区"}
				}
			},
			"07": {
				"name": "呼伦贝尔市",
				"content": {
					"21": {"name": "阿荣旗"},
					"22": {"name": "莫力达瓦达斡尔族自治旗"},
					"23": {"name": "鄂伦春自治旗"},
					"24": {"name": "鄂温克族自治旗"},
					"25": {"name": "陈巴尔虎旗"},
					"26": {"name": "新巴尔虎左旗"},
					"27": {"name": "新巴尔虎右旗"},
					"81": {"name": "满洲里市"},
					"82": {"name": "牙克石市"},
					"83": {"name": "扎兰屯市"},
					"84": {"name": "额尔古纳市"},
					"85": {"name": "根河市"},
					"01": {"name": "市辖区"},
					"02": {"name": "海拉尔区"}
				}
			},
			"08": {
				"name": "巴彦淖尔市",
				"content": {
					"21": {"name": "五原县"},
					"22": {"name": "磴口县"},
					"23": {"name": "乌拉特前旗"},
					"24": {"name": "乌拉特中旗"},
					"25": {"name": "乌拉特后旗"},
					"26": {"name": "杭锦后旗"},
					"01": {"name": "市辖区"},
					"02": {"name": "临河区"}
				}
			},
			"09": {
				"name": "乌兰察布市",
				"content": {
					"21": {"name": "卓资县"},
					"22": {"name": "化德县"},
					"23": {"name": "商都县"},
					"24": {"name": "兴和县"},
					"25": {"name": "凉城县"},
					"26": {"name": "察哈尔右翼前旗"},
					"27": {"name": "察哈尔右翼中旗"},
					"28": {"name": "察哈尔右翼后旗"},
					"29": {"name": "四子王旗"},
					"81": {"name": "丰镇市"},
					"01": {"name": "市辖区"},
					"02": {"name": "集宁区"}
				}
			}
		}
	},
	"21": {
		"name": "辽宁省",
		"content": {
			"10": {
				"name": "辽阳市",
				"content": {
					"11": {"name": "太子河区"},
					"21": {"name": "辽阳县"},
					"81": {"name": "灯塔市"},
					"01": {"name": "市辖区"},
					"02": {"name": "白塔区"},
					"03": {"name": "文圣区"},
					"04": {"name": "宏伟区"},
					"05": {"name": "弓长岭区"}
				}
			},
			"11": {
				"name": "盘锦市",
				"content": {
					"21": {"name": "大洼县"},
					"22": {"name": "盘山县"},
					"01": {"name": "市辖区"},
					"02": {"name": "双台子区"},
					"03": {"name": "兴隆台区"}
				}
			},
			"12": {
				"name": "铁岭市",
				"content": {
					"21": {"name": "铁岭县"},
					"23": {"name": "西丰县"},
					"24": {"name": "昌图县"},
					"81": {"name": "调兵山市"},
					"82": {"name": "开原市"},
					"01": {"name": "市辖区"},
					"02": {"name": "银州区"},
					"04": {"name": "清河区"}
				}
			},
			"13": {
				"name": "朝阳市",
				"content": {
					"21": {"name": "朝阳县"},
					"22": {"name": "建平县"},
					"24": {"name": "喀喇沁左翼蒙古族自治县"},
					"81": {"name": "北票市"},
					"82": {"name": "凌源市"},
					"01": {"name": "市辖区"},
					"02": {"name": "双塔区"},
					"03": {"name": "龙城区"}
				}
			},
			"14": {
				"name": "葫芦岛市",
				"content": {
					"21": {"name": "绥中县"},
					"22": {"name": "建昌县"},
					"81": {"name": "兴城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "连山区"},
					"03": {"name": "龙港区"},
					"04": {"name": "南票区"}
				}
			},
			"01": {
				"name": "沈阳市",
				"content": {
					"11": {"name": "苏家屯区"},
					"12": {"name": "东陵区"},
					"13": {"name": "新城子区"},
					"14": {"name": "于洪区"},
					"22": {"name": "辽中县"},
					"23": {"name": "康平县"},
					"24": {"name": "法库县"},
					"81": {"name": "新民市"},
					"01": {"name": "市辖区"},
					"02": {"name": "和平区"},
					"03": {"name": "沈河区"},
					"04": {"name": "大东区"},
					"05": {"name": "皇姑区"},
					"06": {"name": "铁西区"}
				}
			},
			"02": {
				"name": "大连市",
				"content": {
					"11": {"name": "甘井子区"},
					"12": {"name": "旅顺口区"},
					"13": {"name": "金州区"},
					"24": {"name": "长海县"},
					"81": {"name": "瓦房店市"},
					"82": {"name": "普兰店市"},
					"83": {"name": "庄河市"},
					"01": {"name": "市辖区"},
					"02": {"name": "中山区"},
					"03": {"name": "西岗区"},
					"04": {"name": "沙河口区"}
				}
			},
			"03": {
				"name": "鞍山市",
				"content": {
					"11": {"name": "千山区"},
					"21": {"name": "台安县"},
					"23": {"name": "岫岩满族自治县"},
					"81": {"name": "海城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "铁东区"},
					"03": {"name": "铁西区"},
					"04": {"name": "立山区"}
				}
			},
			"04": {
				"name": "抚顺市",
				"content": {
					"11": {"name": "顺城区"},
					"21": {"name": "抚顺县"},
					"22": {"name": "新宾满族自治县"},
					"23": {"name": "清原满族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "新抚区"},
					"03": {"name": "东洲区"},
					"04": {"name": "望花区"}
				}
			},
			"05": {
				"name": "本溪市",
				"content": {
					"21": {"name": "本溪满族自治县"},
					"22": {"name": "桓仁满族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "平山区"},
					"03": {"name": "溪湖区"},
					"04": {"name": "明山区"},
					"05": {"name": "南芬区"}
				}
			},
			"06": {
				"name": "丹东市",
				"content": {
					"24": {"name": "宽甸满族自治县"},
					"81": {"name": "东港市"},
					"82": {"name": "凤城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "元宝区"},
					"03": {"name": "振兴区"},
					"04": {"name": "振安区"}
				}
			},
			"07": {
				"name": "锦州市",
				"content": {
					"11": {"name": "太和区"},
					"26": {"name": "黑山县"},
					"27": {"name": "义　县"},
					"81": {"name": "凌海市"},
					"82": {"name": "北宁市"},
					"01": {"name": "市辖区"},
					"02": {"name": "古塔区"},
					"03": {"name": "凌河区"}
				}
			},
			"08": {
				"name": "营口市",
				"content": {
					"11": {"name": "老边区"},
					"81": {"name": "盖州市"},
					"82": {"name": "大石桥市"},
					"01": {"name": "市辖区"},
					"02": {"name": "站前区"},
					"03": {"name": "西市区"},
					"04": {"name": "鲅鱼圈区"}
				}
			},
			"09": {
				"name": "阜新市",
				"content": {
					"11": {"name": "细河区"},
					"21": {"name": "阜新蒙古族自治县"},
					"22": {"name": "彰武县"},
					"01": {"name": "市辖区"},
					"02": {"name": "海州区"},
					"03": {"name": "新邱区"},
					"04": {"name": "太平区"},
					"05": {"name": "清河门区"}
				}
			}
		}
	},
	"22": {
		"name": "吉林省",
		"content": {
			"24": {
				"name": "延边朝鲜族自治州",
				"content": {
					"24": {"name": "汪清县"},
					"26": {"name": "安图县"},
					"01": {"name": "延吉市"},
					"02": {"name": "图们市"},
					"03": {"name": "敦化市"},
					"04": {"name": "珲春市"},
					"05": {"name": "龙井市"},
					"06": {"name": "和龙市"}
				}
			},
			"01": {
				"name": "长春市",
				"content": {
					"12": {"name": "双阳区"},
					"22": {"name": "农安县"},
					"81": {"name": "九台市"},
					"82": {"name": "榆树市"},
					"83": {"name": "德惠市"},
					"01": {"name": "市辖区"},
					"02": {"name": "南关区"},
					"03": {"name": "宽城区"},
					"04": {"name": "朝阳区"},
					"05": {"name": "二道区"},
					"06": {"name": "绿园区"}
				}
			},
			"02": {
				"name": "吉林市",
				"content": {
					"11": {"name": "丰满区"},
					"21": {"name": "永吉县"},
					"81": {"name": "蛟河市"},
					"82": {"name": "桦甸市"},
					"83": {"name": "舒兰市"},
					"84": {"name": "磐石市"},
					"01": {"name": "市辖区"},
					"02": {"name": "昌邑区"},
					"03": {"name": "龙潭区"},
					"04": {"name": "船营区"}
				}
			},
			"03": {
				"name": "四平市",
				"content": {
					"22": {"name": "梨树县"},
					"23": {"name": "伊通满族自治县"},
					"81": {"name": "公主岭市"},
					"82": {"name": "双辽市"},
					"01": {"name": "市辖区"},
					"02": {"name": "铁西区"},
					"03": {"name": "铁东区"}
				}
			},
			"04": {
				"name": "辽源市",
				"content": {
					"21": {"name": "东丰县"},
					"22": {"name": "东辽县"},
					"01": {"name": "市辖区"},
					"02": {"name": "龙山区"},
					"03": {"name": "西安区"}
				}
			},
			"05": {
				"name": "通化市",
				"content": {
					"21": {"name": "通化县"},
					"23": {"name": "辉南县"},
					"24": {"name": "柳河县"},
					"81": {"name": "梅河口市"},
					"82": {"name": "集安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "东昌区"},
					"03": {"name": "二道江区"}
				}
			},
			"06": {
				"name": "白山市",
				"content": {
					"21": {"name": "抚松县"},
					"22": {"name": "靖宇县"},
					"23": {"name": "长白朝鲜族自治县"},
					"25": {"name": "江源县"},
					"81": {"name": "临江市"},
					"01": {"name": "市辖区"},
					"02": {"name": "八道江区"}
				}
			},
			"07": {
				"name": "松原市",
				"content": {
					"21": {"name": "前郭尔罗斯蒙古族自治县"},
					"22": {"name": "长岭县"},
					"23": {"name": "乾安县"},
					"24": {"name": "扶余县"},
					"01": {"name": "市辖区"},
					"02": {"name": "宁江区"}
				}
			},
			"08": {
				"name": "白城市",
				"content": {
					"21": {"name": "镇赉县"},
					"22": {"name": "通榆县"},
					"81": {"name": "洮南市"},
					"82": {"name": "大安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "洮北区"}
				}
			}
		}
	},
	"23": {
		"name": "黑龙江",
		"content": {
			"10": {
				"name": "牡丹江市",
				"content": {
					"24": {"name": "东宁县"},
					"25": {"name": "林口县"},
					"81": {"name": "绥芬河市"},
					"83": {"name": "海林市"},
					"84": {"name": "宁安市"},
					"85": {"name": "穆棱市"},
					"01": {"name": "市辖区"},
					"02": {"name": "东安区"},
					"03": {"name": "阳明区"},
					"04": {"name": "爱民区"},
					"05": {"name": "西安区"}
				}
			},
			"11": {
				"name": "黑河市",
				"content": {
					"21": {"name": "嫩江县"},
					"23": {"name": "逊克县"},
					"24": {"name": "孙吴县"},
					"81": {"name": "北安市"},
					"82": {"name": "五大连池市"},
					"01": {"name": "市辖区"},
					"02": {"name": "爱辉区"}
				}
			},
			"12": {
				"name": "绥化市",
				"content": {
					"21": {"name": "望奎县"},
					"22": {"name": "兰西县"},
					"23": {"name": "青冈县"},
					"24": {"name": "庆安县"},
					"25": {"name": "明水县"},
					"26": {"name": "绥棱县"},
					"81": {"name": "安达市"},
					"82": {"name": "肇东市"},
					"83": {"name": "海伦市"},
					"01": {"name": "市辖区"},
					"02": {"name": "北林区"}
				}
			},
			"27": {"name": "大兴安岭地区", "content": {"21": {"name": "呼玛县"}, "22": {"name": "塔河县"}, "23": {"name": "漠河县"}}},
			"01": {
				"name": "哈尔滨市",
				"content": {
					"11": {"name": "呼兰区"},
					"23": {"name": "依兰县"},
					"24": {"name": "方正县"},
					"25": {"name": "宾　县"},
					"26": {"name": "巴彦县"},
					"27": {"name": "木兰县"},
					"28": {"name": "通河县"},
					"29": {"name": "延寿县"},
					"81": {"name": "阿城市"},
					"82": {"name": "双城市"},
					"83": {"name": "尚志市"},
					"84": {"name": "五常市"},
					"01": {"name": "市辖区"},
					"02": {"name": "道里区"},
					"03": {"name": "南岗区"},
					"04": {"name": "道外区"},
					"06": {"name": "香坊区"},
					"07": {"name": "动力区"},
					"08": {"name": "平房区"},
					"09": {"name": "松北区"}
				}
			},
			"02": {
				"name": "齐齐哈尔市",
				"content": {
					"21": {"name": "龙江县"},
					"23": {"name": "依安县"},
					"24": {"name": "泰来县"},
					"25": {"name": "甘南县"},
					"27": {"name": "富裕县"},
					"29": {"name": "克山县"},
					"30": {"name": "克东县"},
					"31": {"name": "拜泉县"},
					"81": {"name": "讷河市"},
					"01": {"name": "市辖区"},
					"02": {"name": "龙沙区"},
					"03": {"name": "建华区"},
					"04": {"name": "铁锋区"},
					"05": {"name": "昂昂溪区"},
					"06": {"name": "富拉尔基区"},
					"07": {"name": "碾子山区"},
					"08": {"name": "梅里斯达斡尔族区"}
				}
			},
			"03": {
				"name": "鸡西市",
				"content": {
					"21": {"name": "鸡东县"},
					"81": {"name": "虎林市"},
					"82": {"name": "密山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鸡冠区"},
					"03": {"name": "恒山区"},
					"04": {"name": "滴道区"},
					"05": {"name": "梨树区"},
					"06": {"name": "城子河区"},
					"07": {"name": "麻山区"}
				}
			},
			"04": {
				"name": "鹤岗市",
				"content": {
					"21": {"name": "萝北县"},
					"22": {"name": "绥滨县"},
					"01": {"name": "市辖区"},
					"02": {"name": "向阳区"},
					"03": {"name": "工农区"},
					"04": {"name": "南山区"},
					"05": {"name": "兴安区"},
					"06": {"name": "东山区"},
					"07": {"name": "兴山区"}
				}
			},
			"05": {
				"name": "双鸭山市",
				"content": {
					"21": {"name": "集贤县"},
					"22": {"name": "友谊县"},
					"23": {"name": "宝清县"},
					"24": {"name": "饶河县"},
					"01": {"name": "市辖区"},
					"02": {"name": "尖山区"},
					"03": {"name": "岭东区"},
					"05": {"name": "四方台区"},
					"06": {"name": "宝山区"}
				}
			},
			"06": {
				"name": "大庆市",
				"content": {
					"21": {"name": "肇州县"},
					"22": {"name": "肇源县"},
					"23": {"name": "林甸县"},
					"24": {"name": "杜尔伯特蒙古族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "萨尔图区"},
					"03": {"name": "龙凤区"},
					"04": {"name": "让胡路区"},
					"05": {"name": "红岗区"},
					"06": {"name": "大同区"}
				}
			},
			"07": {
				"name": "伊春市",
				"content": {
					"10": {"name": "五营区"},
					"11": {"name": "乌马河区"},
					"12": {"name": "汤旺河区"},
					"13": {"name": "带岭区"},
					"14": {"name": "乌伊岭区"},
					"15": {"name": "红星区"},
					"16": {"name": "上甘岭区"},
					"22": {"name": "嘉荫县"},
					"81": {"name": "铁力市"},
					"01": {"name": "市辖区"},
					"02": {"name": "伊春区"},
					"03": {"name": "南岔区"},
					"04": {"name": "友好区"},
					"05": {"name": "西林区"},
					"06": {"name": "翠峦区"},
					"07": {"name": "新青区"},
					"08": {"name": "美溪区"},
					"09": {"name": "金山屯区"}
				}
			},
			"08": {
				"name": "佳木斯市",
				"content": {
					"11": {"name": "郊　区"},
					"22": {"name": "桦南县"},
					"26": {"name": "桦川县"},
					"28": {"name": "汤原县"},
					"33": {"name": "抚远县"},
					"81": {"name": "同江市"},
					"82": {"name": "富锦市"},
					"01": {"name": "市辖区"},
					"02": {"name": "永红区"},
					"03": {"name": "向阳区"},
					"04": {"name": "前进区"},
					"05": {"name": "东风区"}
				}
			},
			"09": {
				"name": "七台河市",
				"content": {
					"21": {"name": "勃利县"},
					"01": {"name": "市辖区"},
					"02": {"name": "新兴区"},
					"03": {"name": "桃山区"},
					"04": {"name": "茄子河区"}
				}
			}
		}
	},
	"31": {
		"name": "上海市",
		"content": {
			"01": {
				"name": "市辖区",
				"content": {
					"10": {"name": "杨浦区"},
					"12": {"name": "闵行区"},
					"13": {"name": "宝山区"},
					"14": {"name": "嘉定区"},
					"15": {"name": "浦东新区"},
					"16": {"name": "金山区"},
					"17": {"name": "松江区"},
					"18": {"name": "青浦区"},
					"19": {"name": "南汇区"},
					"20": {"name": "奉贤区"},
					"01": {"name": "黄浦区"},
					"03": {"name": "卢湾区"},
					"04": {"name": "徐汇区"},
					"05": {"name": "长宁区"},
					"06": {"name": "静安区"},
					"07": {"name": "普陀区"},
					"08": {"name": "闸北区"},
					"09": {"name": "虹口区"}
				}
			}, "02": {"name": "县", "content": {"30": {"name": "崇明县"}}}
		}
	},
	"32": {
		"name": "江苏省",
		"content": {
			"10": {
				"name": "扬州市",
				"content": {
					"11": {"name": "郊　区"},
					"23": {"name": "宝应县"},
					"81": {"name": "仪征市"},
					"84": {"name": "高邮市"},
					"88": {"name": "江都市"},
					"01": {"name": "市辖区"},
					"02": {"name": "广陵区"},
					"03": {"name": "邗江区"}
				}
			},
			"11": {
				"name": "镇江市",
				"content": {
					"11": {"name": "润州区"},
					"12": {"name": "丹徒区"},
					"81": {"name": "丹阳市"},
					"82": {"name": "扬中市"},
					"83": {"name": "句容市"},
					"01": {"name": "市辖区"},
					"02": {"name": "京口区"}
				}
			},
			"12": {
				"name": "泰州市",
				"content": {
					"81": {"name": "兴化市"},
					"82": {"name": "靖江市"},
					"83": {"name": "泰兴市"},
					"84": {"name": "姜堰市"},
					"01": {"name": "市辖区"},
					"02": {"name": "海陵区"},
					"03": {"name": "高港区"}
				}
			},
			"13": {
				"name": "宿迁市",
				"content": {
					"11": {"name": "宿豫区"},
					"22": {"name": "沭阳县"},
					"23": {"name": "泗阳县"},
					"24": {"name": "泗洪县"},
					"01": {"name": "市辖区"},
					"02": {"name": "宿城区"}
				}
			},
			"01": {
				"name": "南京市",
				"content": {
					"11": {"name": "浦口区"},
					"13": {"name": "栖霞区"},
					"14": {"name": "雨花台区"},
					"15": {"name": "江宁区"},
					"16": {"name": "六合区"},
					"24": {"name": "溧水县"},
					"25": {"name": "高淳县"},
					"01": {"name": "市辖区"},
					"02": {"name": "玄武区"},
					"03": {"name": "白下区"},
					"04": {"name": "秦淮区"},
					"05": {"name": "建邺区"},
					"06": {"name": "鼓楼区"},
					"07": {"name": "下关区"}
				}
			},
			"02": {
				"name": "无锡市",
				"content": {
					"11": {"name": "滨湖区"},
					"81": {"name": "江阴市"},
					"82": {"name": "宜兴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "崇安区"},
					"03": {"name": "南长区"},
					"04": {"name": "北塘区"},
					"05": {"name": "锡山区"},
					"06": {"name": "惠山区"}
				}
			},
			"03": {
				"name": "徐州市",
				"content": {
					"11": {"name": "泉山区"},
					"21": {"name": "丰　县"},
					"22": {"name": "沛　县"},
					"23": {"name": "铜山县"},
					"24": {"name": "睢宁县"},
					"81": {"name": "新沂市"},
					"82": {"name": "邳州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鼓楼区"},
					"03": {"name": "云龙区"},
					"04": {"name": "九里区"},
					"05": {"name": "贾汪区"}
				}
			},
			"04": {
				"name": "常州市",
				"content": {
					"11": {"name": "新北区"},
					"12": {"name": "武进区"},
					"81": {"name": "溧阳市"},
					"82": {"name": "金坛市"},
					"01": {"name": "市辖区"},
					"02": {"name": "天宁区"},
					"04": {"name": "钟楼区"},
					"05": {"name": "戚墅堰区"}
				}
			},
			"05": {
				"name": "苏州市",
				"content": {
					"81": {"name": "常熟市"},
					"82": {"name": "张家港市"},
					"83": {"name": "昆山市"},
					"84": {"name": "吴江市"},
					"85": {"name": "太仓市"},
					"01": {"name": "市辖区"},
					"02": {"name": "沧浪区"},
					"03": {"name": "平江区"},
					"04": {"name": "金阊区"},
					"05": {"name": "虎丘区"},
					"06": {"name": "吴中区"},
					"07": {"name": "相城区"}
				}
			},
			"06": {
				"name": "南通市",
				"content": {
					"11": {"name": "港闸区"},
					"21": {"name": "海安县"},
					"23": {"name": "如东县"},
					"81": {"name": "启东市"},
					"82": {"name": "如皋市"},
					"83": {"name": "通州市"},
					"84": {"name": "海门市"},
					"01": {"name": "市辖区"},
					"02": {"name": "崇川区"}
				}
			},
			"07": {
				"name": "连云港市",
				"content": {
					"21": {"name": "赣榆县"},
					"22": {"name": "东海县"},
					"23": {"name": "灌云县"},
					"24": {"name": "灌南县"},
					"01": {"name": "市辖区"},
					"03": {"name": "连云区"},
					"05": {"name": "新浦区"},
					"06": {"name": "海州区"}
				}
			},
			"08": {
				"name": "淮安市",
				"content": {
					"11": {"name": "清浦区"},
					"26": {"name": "涟水县"},
					"29": {"name": "洪泽县"},
					"30": {"name": "盱眙县"},
					"31": {"name": "金湖县"},
					"01": {"name": "市辖区"},
					"02": {"name": "清河区"},
					"03": {"name": "楚州区"},
					"04": {"name": "淮阴区"}
				}
			},
			"09": {
				"name": "盐城市",
				"content": {
					"21": {"name": "响水县"},
					"22": {"name": "滨海县"},
					"23": {"name": "阜宁县"},
					"24": {"name": "射阳县"},
					"25": {"name": "建湖县"},
					"81": {"name": "东台市"},
					"82": {"name": "大丰市"},
					"01": {"name": "市辖区"},
					"02": {"name": "亭湖区"},
					"03": {"name": "盐都区"}
				}
			}
		}
	},
	"33": {
		"name": "浙江省",
		"content": {

			"01": {
				"name": "杭州市",
				"content": {
					"01": {"name": "市辖区"},
					"02": {"name": "上城区"},
					"03": {"name": "下城区"},
					"04": {"name": "江干区"},
					"05": {"name": "拱墅区"},
					"06": {"name": "西湖区"},
					"08": {"name": "滨江区"},
					"09": {"name": "萧山区"},
					"10": {"name": "余杭区"},
					"22": {"name": "桐庐县"},
					"27": {"name": "淳安县"},
					"82": {"name": "建德市"},
					"83": {"name": "富阳市"},
					"85": {"name": "临安市"}
				}
			},
			"02": {
				"name": "宁波市",
				"content": {
					"11": {"name": "镇海区"},
					"12": {"name": "鄞州区"},
					"25": {"name": "象山县"},
					"26": {"name": "宁海县"},
					"81": {"name": "余姚市"},
					"82": {"name": "慈溪市"},
					"83": {"name": "奉化市"},
					"01": {"name": "市辖区"},
					"03": {"name": "海曙区"},
					"04": {"name": "江东区"},
					"05": {"name": "江北区"},
					"06": {"name": "北仑区"}
				}
			},
			"03": {
				"name": "温州市",
				"content": {
					"22": {"name": "洞头县"},
					"24": {"name": "永嘉县"},
					"26": {"name": "平阳县"},
					"27": {"name": "苍南县"},
					"28": {"name": "文成县"},
					"29": {"name": "泰顺县"},
					"81": {"name": "瑞安市"},
					"82": {"name": "乐清市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鹿城区"},
					"03": {"name": "龙湾区"},
					"04": {"name": "瓯海区"}
				}
			},
			"04": {
				"name": "嘉兴市",
				"content": {
					"11": {"name": "秀洲区"},
					"21": {"name": "嘉善县"},
					"24": {"name": "海盐县"},
					"81": {"name": "海宁市"},
					"82": {"name": "平湖市"},
					"83": {"name": "桐乡市"},
					"01": {"name": "市辖区"},
					"02": {"name": "秀城区"}
				}
			},
			"05": {
				"name": "湖州市",
				"content": {
					"21": {"name": "德清县"},
					"22": {"name": "长兴县"},
					"23": {"name": "安吉县"},
					"01": {"name": "市辖区"},
					"02": {"name": "吴兴区"},
					"03": {"name": "南浔区"}
				}
			},
			"06": {
				"name": "绍兴市",
				"content": {
					"21": {"name": "绍兴县"},
					"24": {"name": "新昌县"},
					"81": {"name": "诸暨市"},
					"82": {"name": "上虞市"},
					"83": {"name": "嵊州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "越城区"}
				}
			},
			"07": {
				"name": "金华市",
				"content": {
					"23": {"name": "武义县"},
					"26": {"name": "浦江县"},
					"27": {"name": "磐安县"},
					"81": {"name": "兰溪市"},
					"82": {"name": "义乌市"},
					"83": {"name": "东阳市"},
					"84": {"name": "永康市"},
					"01": {"name": "市辖区"},
					"02": {"name": "婺城区"},
					"03": {"name": "金东区"}
				}
			},
			"08": {
				"name": "衢州市",
				"content": {
					"22": {"name": "常山县"},
					"24": {"name": "开化县"},
					"25": {"name": "龙游县"},
					"81": {"name": "江山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "柯城区"},
					"03": {"name": "衢江区"}
				}
			},
			"09": {
				"name": "舟山市",
				"content": {
					"21": {"name": "岱山县"},
					"22": {"name": "嵊泗县"},
					"01": {"name": "市辖区"},
					"02": {"name": "定海区"},
					"03": {"name": "普陀区"}
				}
			},
			"10": {
				"name": "台州市",
				"content": {
					"21": {"name": "玉环县"},
					"22": {"name": "三门县"},
					"23": {"name": "天台县"},
					"24": {"name": "仙居县"},
					"81": {"name": "温岭市"},
					"82": {"name": "临海市"},
					"01": {"name": "市辖区"},
					"02": {"name": "椒江区"},
					"03": {"name": "黄岩区"},
					"04": {"name": "路桥区"}
				}
			},
			"11": {
				"name": "丽水市",
				"content": {
					"21": {"name": "青田县"},
					"22": {"name": "缙云县"},
					"23": {"name": "遂昌县"},
					"24": {"name": "松阳县"},
					"25": {"name": "云和县"},
					"26": {"name": "庆元县"},
					"27": {"name": "景宁畲族自治县"},
					"81": {"name": "龙泉市"},
					"01": {"name": "市辖区"},
					"02": {"name": "莲都区"}
				}
			}
		}
	},
	"34": {
		"name": "安徽省",
		"content": {
			"10": {
				"name": "黄山市",
				"content": {
					"21": {"name": "歙　县"},
					"22": {"name": "休宁县"},
					"23": {"name": "黟　县"},
					"24": {"name": "祁门县"},
					"01": {"name": "市辖区"},
					"02": {"name": "屯溪区"},
					"03": {"name": "黄山区"},
					"04": {"name": "徽州区"}
				}
			},
			"11": {
				"name": "滁州市",
				"content": {
					"22": {"name": "来安县"},
					"24": {"name": "全椒县"},
					"25": {"name": "定远县"},
					"26": {"name": "凤阳县"},
					"81": {"name": "天长市"},
					"82": {"name": "明光市"},
					"01": {"name": "市辖区"},
					"02": {"name": "琅琊区"},
					"03": {"name": "南谯区"}
				}
			},
			"12": {
				"name": "阜阳市",
				"content": {
					"21": {"name": "临泉县"},
					"22": {"name": "太和县"},
					"25": {"name": "阜南县"},
					"26": {"name": "颍上县"},
					"82": {"name": "界首市"},
					"01": {"name": "市辖区"},
					"02": {"name": "颍州区"},
					"03": {"name": "颍东区"},
					"04": {"name": "颍泉区"}
				}
			},
			"13": {
				"name": "宿州市",
				"content": {
					"21": {"name": "砀山县"},
					"22": {"name": "萧　县"},
					"23": {"name": "灵璧县"},
					"24": {"name": "泗　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "墉桥区"}
				}
			},
			"14": {
				"name": "巢湖市",
				"content": {
					"21": {"name": "庐江县"},
					"22": {"name": "无为县"},
					"23": {"name": "含山县"},
					"24": {"name": "和　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "居巢区"}
				}
			},
			"15": {
				"name": "六安市",
				"content": {
					"21": {"name": "寿　县"},
					"22": {"name": "霍邱县"},
					"23": {"name": "舒城县"},
					"24": {"name": "金寨县"},
					"25": {"name": "霍山县"},
					"01": {"name": "市辖区"},
					"02": {"name": "金安区"},
					"03": {"name": "裕安区"}
				}
			},
			"16": {
				"name": "亳州市",
				"content": {
					"21": {"name": "涡阳县"},
					"22": {"name": "蒙城县"},
					"23": {"name": "利辛县"},
					"01": {"name": "市辖区"},
					"02": {"name": "谯城区"}
				}
			},
			"17": {
				"name": "池州市",
				"content": {
					"21": {"name": "东至县"},
					"22": {"name": "石台县"},
					"23": {"name": "青阳县"},
					"01": {"name": "市辖区"},
					"02": {"name": "贵池区"}
				}
			},
			"18": {
				"name": "宣城市",
				"content": {
					"21": {"name": "郎溪县"},
					"22": {"name": "广德县"},
					"23": {"name": "泾　县"},
					"24": {"name": "绩溪县"},
					"25": {"name": "旌德县"},
					"81": {"name": "宁国市"},
					"01": {"name": "市辖区"},
					"02": {"name": "宣州区"}
				}
			},
			"01": {
				"name": "合肥市",
				"content": {
					"11": {"name": "包河区"},
					"21": {"name": "长丰县"},
					"22": {"name": "肥东县"},
					"23": {"name": "肥西县"},
					"01": {"name": "市辖区"},
					"02": {"name": "瑶海区"},
					"03": {"name": "庐阳区"},
					"04": {"name": "蜀山区"}
				}
			},
			"02": {
				"name": "芜湖市",
				"content": {
					"21": {"name": "芜湖县"},
					"22": {"name": "繁昌县"},
					"23": {"name": "南陵县"},
					"01": {"name": "市辖区"},
					"02": {"name": "镜湖区"},
					"03": {"name": "马塘区"},
					"04": {"name": "新芜区"},
					"07": {"name": "鸠江区"}
				}
			},
			"03": {
				"name": "蚌埠市",
				"content": {
					"11": {"name": "淮上区"},
					"21": {"name": "怀远县"},
					"22": {"name": "五河县"},
					"23": {"name": "固镇县"},
					"01": {"name": "市辖区"},
					"02": {"name": "龙子湖区"},
					"03": {"name": "蚌山区"},
					"04": {"name": "禹会区"}
				}
			},
			"04": {
				"name": "淮南市",
				"content": {
					"21": {"name": "凤台县"},
					"01": {"name": "市辖区"},
					"02": {"name": "大通区"},
					"03": {"name": "田家庵区"},
					"04": {"name": "谢家集区"},
					"05": {"name": "八公山区"},
					"06": {"name": "潘集区"}
				}
			},
			"05": {
				"name": "马鞍山市",
				"content": {
					"21": {"name": "当涂县"},
					"01": {"name": "市辖区"},
					"02": {"name": "金家庄区"},
					"03": {"name": "花山区"},
					"04": {"name": "雨山区"}
				}
			},
			"06": {
				"name": "淮北市",
				"content": {
					"21": {"name": "濉溪县"},
					"01": {"name": "市辖区"},
					"02": {"name": "杜集区"},
					"03": {"name": "相山区"},
					"04": {"name": "烈山区"}
				}
			},
			"07": {
				"name": "铜陵市",
				"content": {
					"11": {"name": "郊　区"},
					"21": {"name": "铜陵县"},
					"01": {"name": "市辖区"},
					"02": {"name": "铜官山区"},
					"03": {"name": "狮子山区"}
				}
			},
			"08": {
				"name": "安庆市",
				"content": {
					"11": {"name": "郊　区"},
					"22": {"name": "怀宁县"},
					"23": {"name": "枞阳县"},
					"24": {"name": "潜山县"},
					"25": {"name": "太湖县"},
					"26": {"name": "宿松县"},
					"27": {"name": "望江县"},
					"28": {"name": "岳西县"},
					"81": {"name": "桐城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "迎江区"},
					"03": {"name": "大观区"}
				}
			}
		}
	},
	"35": {
		"name": "福建省",
		"content": {
			"01": {
				"name": "福州市",
				"content": {
					"11": {"name": "晋安区"},
					"21": {"name": "闽侯县"},
					"22": {"name": "连江县"},
					"23": {"name": "罗源县"},
					"24": {"name": "闽清县"},
					"25": {"name": "永泰县"},
					"28": {"name": "平潭县"},
					"81": {"name": "福清市"},
					"82": {"name": "长乐市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鼓楼区"},
					"03": {"name": "台江区"},
					"04": {"name": "仓山区"},
					"05": {"name": "马尾区"}
				}
			},
			"02": {
				"name": "厦门市",
				"content": {
					"11": {"name": "集美区"},
					"12": {"name": "同安区"},
					"13": {"name": "翔安区"},
					"01": {"name": "市辖区"},
					"03": {"name": "思明区"},
					"05": {"name": "海沧区"},
					"06": {"name": "湖里区"}
				}
			},
			"03": {
				"name": "莆田市",
				"content": {
					"22": {"name": "仙游县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城厢区"},
					"03": {"name": "涵江区"},
					"04": {"name": "荔城区"},
					"05": {"name": "秀屿区"}
				}
			},
			"04": {
				"name": "三明市",
				"content": {
					"21": {"name": "明溪县"},
					"23": {"name": "清流县"},
					"24": {"name": "宁化县"},
					"25": {"name": "大田县"},
					"26": {"name": "尤溪县"},
					"27": {"name": "沙　县"},
					"28": {"name": "将乐县"},
					"29": {"name": "泰宁县"},
					"30": {"name": "建宁县"},
					"81": {"name": "永安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "梅列区"},
					"03": {"name": "三元区"}
				}
			},
			"05": {
				"name": "泉州市",
				"content": {
					"21": {"name": "惠安县"},
					"24": {"name": "安溪县"},
					"25": {"name": "永春县"},
					"26": {"name": "德化县"},
					"27": {"name": "金门县"},
					"81": {"name": "石狮市"},
					"82": {"name": "晋江市"},
					"83": {"name": "南安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鲤城区"},
					"03": {"name": "丰泽区"},
					"04": {"name": "洛江区"},
					"05": {"name": "泉港区"}
				}
			},
			"06": {
				"name": "漳州市",
				"content": {
					"22": {"name": "云霄县"},
					"23": {"name": "漳浦县"},
					"24": {"name": "诏安县"},
					"25": {"name": "长泰县"},
					"26": {"name": "东山县"},
					"27": {"name": "南靖县"},
					"28": {"name": "平和县"},
					"29": {"name": "华安县"},
					"81": {"name": "龙海市"},
					"01": {"name": "市辖区"},
					"02": {"name": "芗城区"},
					"03": {"name": "龙文区"}
				}
			},
			"07": {
				"name": "南平市",
				"content": {
					"21": {"name": "顺昌县"},
					"22": {"name": "浦城县"},
					"23": {"name": "光泽县"},
					"24": {"name": "松溪县"},
					"25": {"name": "政和县"},
					"81": {"name": "邵武市"},
					"82": {"name": "武夷山市"},
					"83": {"name": "建瓯市"},
					"84": {"name": "建阳市"},
					"01": {"name": "市辖区"},
					"02": {"name": "延平区"}
				}
			},
			"08": {
				"name": "龙岩市",
				"content": {
					"21": {"name": "长汀县"},
					"22": {"name": "永定县"},
					"23": {"name": "上杭县"},
					"24": {"name": "武平县"},
					"25": {"name": "连城县"},
					"81": {"name": "漳平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "新罗区"}
				}
			},
			"09": {
				"name": "宁德市",
				"content": {
					"21": {"name": "霞浦县"},
					"22": {"name": "古田县"},
					"23": {"name": "屏南县"},
					"24": {"name": "寿宁县"},
					"25": {"name": "周宁县"},
					"26": {"name": "柘荣县"},
					"81": {"name": "福安市"},
					"82": {"name": "福鼎市"},
					"01": {"name": "市辖区"},
					"02": {"name": "蕉城区"}
				}
			}
		}
	},
	"36": {
		"name": "江西省",
		"content": {
			"10": {
				"name": "抚州市",
				"content": {
					"21": {"name": "南城县"},
					"22": {"name": "黎川县"},
					"23": {"name": "南丰县"},
					"24": {"name": "崇仁县"},
					"25": {"name": "乐安县"},
					"26": {"name": "宜黄县"},
					"27": {"name": "金溪县"},
					"28": {"name": "资溪县"},
					"29": {"name": "东乡县"},
					"30": {"name": "广昌县"},
					"01": {"name": "市辖区"},
					"02": {"name": "临川区"}
				}
			},
			"11": {
				"name": "上饶市",
				"content": {
					"21": {"name": "上饶县"},
					"22": {"name": "广丰县"},
					"23": {"name": "玉山县"},
					"24": {"name": "铅山县"},
					"25": {"name": "横峰县"},
					"26": {"name": "弋阳县"},
					"27": {"name": "余干县"},
					"28": {"name": "鄱阳县"},
					"29": {"name": "万年县"},
					"30": {"name": "婺源县"},
					"81": {"name": "德兴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "信州区"}
				}
			},
			"01": {
				"name": "南昌市",
				"content": {
					"11": {"name": "青山湖区"},
					"21": {"name": "南昌县"},
					"22": {"name": "新建县"},
					"23": {"name": "安义县"},
					"24": {"name": "进贤县"},
					"01": {"name": "市辖区"},
					"02": {"name": "东湖区"},
					"03": {"name": "西湖区"},
					"04": {"name": "青云谱区"},
					"05": {"name": "湾里区"}
				}
			},
			"02": {
				"name": "景德镇市",
				"content": {
					"22": {"name": "浮梁县"},
					"81": {"name": "乐平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "昌江区"},
					"03": {"name": "珠山区"}
				}
			},
			"03": {
				"name": "萍乡市",
				"content": {
					"13": {"name": "湘东区"},
					"21": {"name": "莲花县"},
					"22": {"name": "上栗县"},
					"23": {"name": "芦溪县"},
					"01": {"name": "市辖区"},
					"02": {"name": "安源区"}
				}
			},
			"04": {
				"name": "九江市",
				"content": {
					"21": {"name": "九江县"},
					"23": {"name": "武宁县"},
					"24": {"name": "修水县"},
					"25": {"name": "永修县"},
					"26": {"name": "德安县"},
					"27": {"name": "星子县"},
					"28": {"name": "都昌县"},
					"29": {"name": "湖口县"},
					"30": {"name": "彭泽县"},
					"81": {"name": "瑞昌市"},
					"01": {"name": "市辖区"},
					"02": {"name": "庐山区"},
					"03": {"name": "浔阳区"}
				}
			},
			"05": {"name": "新余市", "content": {"21": {"name": "分宜县"}, "01": {"name": "市辖区"}, "02": {"name": "渝水区"}}},
			"06": {
				"name": "鹰潭市",
				"content": {"22": {"name": "余江县"}, "81": {"name": "贵溪市"}, "01": {"name": "市辖区"}, "02": {"name": "月湖区"}}
			},
			"07": {
				"name": "赣州市",
				"content": {
					"21": {"name": "赣　县"},
					"22": {"name": "信丰县"},
					"23": {"name": "大余县"},
					"24": {"name": "上犹县"},
					"25": {"name": "崇义县"},
					"26": {"name": "安远县"},
					"27": {"name": "龙南县"},
					"28": {"name": "定南县"},
					"29": {"name": "全南县"},
					"30": {"name": "宁都县"},
					"31": {"name": "于都县"},
					"32": {"name": "兴国县"},
					"33": {"name": "会昌县"},
					"34": {"name": "寻乌县"},
					"35": {"name": "石城县"},
					"81": {"name": "瑞金市"},
					"82": {"name": "南康市"},
					"01": {"name": "市辖区"},
					"02": {"name": "章贡区"}
				}
			},
			"08": {
				"name": "吉安市",
				"content": {
					"21": {"name": "吉安县"},
					"22": {"name": "吉水县"},
					"23": {"name": "峡江县"},
					"24": {"name": "新干县"},
					"25": {"name": "永丰县"},
					"26": {"name": "泰和县"},
					"27": {"name": "遂川县"},
					"28": {"name": "万安县"},
					"29": {"name": "安福县"},
					"30": {"name": "永新县"},
					"81": {"name": "井冈山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "吉州区"},
					"03": {"name": "青原区"}
				}
			},
			"09": {
				"name": "宜春市",
				"content": {
					"21": {"name": "奉新县"},
					"22": {"name": "万载县"},
					"23": {"name": "上高县"},
					"24": {"name": "宜丰县"},
					"25": {"name": "靖安县"},
					"26": {"name": "铜鼓县"},
					"81": {"name": "丰城市"},
					"82": {"name": "樟树市"},
					"83": {"name": "高安市"},
					"01": {"name": "市辖区"},
					"02": {"name": "袁州区"}
				}
			}
		}
	},
	"37": {
		"name": "山东省",
		"content": {
			"10": {
				"name": "威海市",
				"content": {
					"81": {"name": "文登市"},
					"82": {"name": "荣成市"},
					"83": {"name": "乳山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "环翠区"}
				}
			},
			"11": {
				"name": "日照市",
				"content": {
					"21": {"name": "五莲县"},
					"22": {"name": "莒　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "东港区"},
					"03": {"name": "岚山区"}
				}
			},
			"12": {"name": "莱芜市", "content": {"01": {"name": "市辖区"}, "02": {"name": "莱城区"}, "03": {"name": "钢城区"}}},
			"13": {
				"name": "临沂市",
				"content": {
					"11": {"name": "罗庄区"},
					"12": {"name": "河东区"},
					"21": {"name": "沂南县"},
					"22": {"name": "郯城县"},
					"23": {"name": "沂水县"},
					"24": {"name": "苍山县"},
					"25": {"name": "费　县"},
					"26": {"name": "平邑县"},
					"27": {"name": "莒南县"},
					"28": {"name": "蒙阴县"},
					"29": {"name": "临沭县"},
					"01": {"name": "市辖区"},
					"02": {"name": "兰山区"}
				}
			},
			"14": {
				"name": "德州市",
				"content": {
					"21": {"name": "陵　县"},
					"22": {"name": "宁津县"},
					"23": {"name": "庆云县"},
					"24": {"name": "临邑县"},
					"25": {"name": "齐河县"},
					"26": {"name": "平原县"},
					"27": {"name": "夏津县"},
					"28": {"name": "武城县"},
					"81": {"name": "乐陵市"},
					"82": {"name": "禹城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "德城区"}
				}
			},
			"15": {
				"name": "聊城市",
				"content": {
					"21": {"name": "阳谷县"},
					"22": {"name": "莘　县"},
					"23": {"name": "茌平县"},
					"24": {"name": "东阿县"},
					"25": {"name": "冠　县"},
					"26": {"name": "高唐县"},
					"81": {"name": "临清市"},
					"01": {"name": "市辖区"},
					"02": {"name": "东昌府区"}
				}
			},
			"16": {
				"name": "滨州市",
				"content": {
					"21": {"name": "惠民县"},
					"22": {"name": "阳信县"},
					"23": {"name": "无棣县"},
					"24": {"name": "沾化县"},
					"25": {"name": "博兴县"},
					"26": {"name": "邹平县"},
					"01": {"name": "市辖区"},
					"02": {"name": "滨城区"}
				}
			},
			"17": {
				"name": "荷泽市",
				"content": {
					"21": {"name": "曹　县"},
					"22": {"name": "单　县"},
					"23": {"name": "成武县"},
					"24": {"name": "巨野县"},
					"25": {"name": "郓城县"},
					"26": {"name": "鄄城县"},
					"27": {"name": "定陶县"},
					"28": {"name": "东明县"},
					"01": {"name": "市辖区"},
					"02": {"name": "牡丹区"}
				}
			},
			"01": {
				"name": "济南市",
				"content": {
					"12": {"name": "历城区"},
					"13": {"name": "长清区"},
					"24": {"name": "平阴县"},
					"25": {"name": "济阳县"},
					"26": {"name": "商河县"},
					"81": {"name": "章丘市"},
					"01": {"name": "市辖区"},
					"02": {"name": "历下区"},
					"03": {"name": "市中区"},
					"04": {"name": "槐荫区"},
					"05": {"name": "天桥区"}
				}
			},
			"02": {
				"name": "青岛市",
				"content": {
					"11": {"name": "黄岛区"},
					"12": {"name": "崂山区"},
					"13": {"name": "李沧区"},
					"14": {"name": "城阳区"},
					"81": {"name": "胶州市"},
					"82": {"name": "即墨市"},
					"83": {"name": "平度市"},
					"84": {"name": "胶南市"},
					"85": {"name": "莱西市"},
					"01": {"name": "市辖区"},
					"02": {"name": "市南区"},
					"03": {"name": "市北区"},
					"05": {"name": "四方区"}
				}
			},
			"03": {
				"name": "淄博市",
				"content": {
					"21": {"name": "桓台县"},
					"22": {"name": "高青县"},
					"23": {"name": "沂源县"},
					"01": {"name": "市辖区"},
					"02": {"name": "淄川区"},
					"03": {"name": "张店区"},
					"04": {"name": "博山区"},
					"05": {"name": "临淄区"},
					"06": {"name": "周村区"}
				}
			},
			"04": {
				"name": "枣庄市",
				"content": {
					"81": {"name": "滕州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "市中区"},
					"03": {"name": "薛城区"},
					"04": {"name": "峄城区"},
					"05": {"name": "台儿庄区"},
					"06": {"name": "山亭区"}
				}
			},
			"05": {
				"name": "东营市",
				"content": {
					"21": {"name": "垦利县"},
					"22": {"name": "利津县"},
					"23": {"name": "广饶县"},
					"01": {"name": "市辖区"},
					"02": {"name": "东营区"},
					"03": {"name": "河口区"}
				}
			},
			"06": {
				"name": "烟台市",
				"content": {
					"11": {"name": "福山区"},
					"12": {"name": "牟平区"},
					"13": {"name": "莱山区"},
					"34": {"name": "长岛县"},
					"81": {"name": "龙口市"},
					"82": {"name": "莱阳市"},
					"83": {"name": "莱州市"},
					"84": {"name": "蓬莱市"},
					"85": {"name": "招远市"},
					"86": {"name": "栖霞市"},
					"87": {"name": "海阳市"},
					"01": {"name": "市辖区"},
					"02": {"name": "芝罘区"}
				}
			},
			"07": {
				"name": "潍坊市",
				"content": {
					"24": {"name": "临朐县"},
					"25": {"name": "昌乐县"},
					"81": {"name": "青州市"},
					"82": {"name": "诸城市"},
					"83": {"name": "寿光市"},
					"84": {"name": "安丘市"},
					"85": {"name": "高密市"},
					"86": {"name": "昌邑市"},
					"01": {"name": "市辖区"},
					"02": {"name": "潍城区"},
					"03": {"name": "寒亭区"},
					"04": {"name": "坊子区"},
					"05": {"name": "奎文区"}
				}
			},
			"08": {
				"name": "济宁市",
				"content": {
					"11": {"name": "任城区"},
					"26": {"name": "微山县"},
					"27": {"name": "鱼台县"},
					"28": {"name": "金乡县"},
					"29": {"name": "嘉祥县"},
					"30": {"name": "汶上县"},
					"31": {"name": "泗水县"},
					"32": {"name": "梁山县"},
					"81": {"name": "曲阜市"},
					"82": {"name": "兖州市"},
					"83": {"name": "邹城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "市中区"}
				}
			},
			"09": {
				"name": "泰安市",
				"content": {
					"21": {"name": "宁阳县"},
					"23": {"name": "东平县"},
					"82": {"name": "新泰市"},
					"83": {"name": "肥城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "泰山区"},
					"03": {"name": "岱岳区"}
				}
			}
		}
	},
	"41": {
		"name": "河南省",
		"content": {
			"10": {
				"name": "许昌市",
				"content": {
					"23": {"name": "许昌县"},
					"24": {"name": "鄢陵县"},
					"25": {"name": "襄城县"},
					"81": {"name": "禹州市"},
					"82": {"name": "长葛市"},
					"01": {"name": "市辖区"},
					"02": {"name": "魏都区"}
				}
			},
			"11": {
				"name": "漯河市",
				"content": {
					"21": {"name": "舞阳县"},
					"22": {"name": "临颍县"},
					"01": {"name": "市辖区"},
					"02": {"name": "源汇区"},
					"03": {"name": "郾城区"},
					"04": {"name": "召陵区"}
				}
			},
			"12": {
				"name": "三门峡市",
				"content": {
					"21": {"name": "渑池县"},
					"22": {"name": "陕　县"},
					"24": {"name": "卢氏县"},
					"81": {"name": "义马市"},
					"82": {"name": "灵宝市"},
					"01": {"name": "市辖区"},
					"02": {"name": "湖滨区"}
				}
			},
			"13": {
				"name": "南阳市",
				"content": {
					"21": {"name": "南召县"},
					"22": {"name": "方城县"},
					"23": {"name": "西峡县"},
					"24": {"name": "镇平县"},
					"25": {"name": "内乡县"},
					"26": {"name": "淅川县"},
					"27": {"name": "社旗县"},
					"28": {"name": "唐河县"},
					"29": {"name": "新野县"},
					"30": {"name": "桐柏县"},
					"81": {"name": "邓州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "宛城区"},
					"03": {"name": "卧龙区"}
				}
			},
			"14": {
				"name": "商丘市",
				"content": {
					"21": {"name": "民权县"},
					"22": {"name": "睢　县"},
					"23": {"name": "宁陵县"},
					"24": {"name": "柘城县"},
					"25": {"name": "虞城县"},
					"26": {"name": "夏邑县"},
					"81": {"name": "永城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "梁园区"},
					"03": {"name": "睢阳区"}
				}
			},
			"15": {
				"name": "信阳市",
				"content": {
					"21": {"name": "罗山县"},
					"22": {"name": "光山县"},
					"23": {"name": "新　县"},
					"24": {"name": "商城县"},
					"25": {"name": "固始县"},
					"26": {"name": "潢川县"},
					"27": {"name": "淮滨县"},
					"28": {"name": "息　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "师河区"},
					"03": {"name": "平桥区"}
				}
			},
			"16": {
				"name": "周口市",
				"content": {
					"21": {"name": "扶沟县"},
					"22": {"name": "西华县"},
					"23": {"name": "商水县"},
					"24": {"name": "沈丘县"},
					"25": {"name": "郸城县"},
					"26": {"name": "淮阳县"},
					"27": {"name": "太康县"},
					"28": {"name": "鹿邑县"},
					"81": {"name": "项城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "川汇区"}
				}
			},
			"17": {
				"name": "驻马店市",
				"content": {
					"21": {"name": "西平县"},
					"22": {"name": "上蔡县"},
					"23": {"name": "平舆县"},
					"24": {"name": "正阳县"},
					"25": {"name": "确山县"},
					"26": {"name": "泌阳县"},
					"27": {"name": "汝南县"},
					"28": {"name": "遂平县"},
					"29": {"name": "新蔡县"},
					"01": {"name": "市辖区"},
					"02": {"name": "驿城区"}
				}
			},
			"01": {
				"name": "郑州市",
				"content": {
					"22": {"name": "中牟县"},
					"81": {"name": "巩义市"},
					"82": {"name": "荥阳市"},
					"83": {"name": "新密市"},
					"84": {"name": "新郑市"},
					"85": {"name": "登封市"},
					"01": {"name": "市辖区"},
					"02": {"name": "中原区"},
					"03": {"name": "二七区"},
					"04": {"name": "管城回族区"},
					"05": {"name": "金水区"},
					"06": {"name": "上街区"},
					"08": {"name": "邙山区"}
				}
			},
			"02": {
				"name": "开封市",
				"content": {
					"11": {"name": "郊　区"},
					"21": {"name": "杞　县"},
					"22": {"name": "通许县"},
					"23": {"name": "尉氏县"},
					"24": {"name": "开封县"},
					"25": {"name": "兰考县"},
					"01": {"name": "市辖区"},
					"02": {"name": "龙亭区"},
					"03": {"name": "顺河回族区"},
					"04": {"name": "鼓楼区"},
					"05": {"name": "南关区"}
				}
			},
			"03": {
				"name": "洛阳市",
				"content": {
					"22": {"name": "孟津县"},
					"23": {"name": "新安县"},
					"24": {"name": "栾川县"},
					"25": {"name": "嵩　县"},
					"26": {"name": "汝阳县"},
					"27": {"name": "宜阳县"},
					"28": {"name": "洛宁县"},
					"29": {"name": "伊川县"},
					"81": {"name": "偃师市"},
					"01": {"name": "市辖区"},
					"02": {"name": "老城区"},
					"03": {"name": "西工区"},
					"04": {"name": "廛河回族区"},
					"05": {"name": "涧西区"},
					"06": {"name": "吉利区"},
					"07": {"name": "洛龙区"}
				}
			},
			"04": {
				"name": "平顶山市",
				"content": {
					"11": {"name": "湛河区"},
					"21": {"name": "宝丰县"},
					"22": {"name": "叶　县"},
					"23": {"name": "鲁山县"},
					"25": {"name": "郏　县"},
					"81": {"name": "舞钢市"},
					"82": {"name": "汝州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "新华区"},
					"03": {"name": "卫东区"},
					"04": {"name": "石龙区"}
				}
			},
			"05": {
				"name": "安阳市",
				"content": {
					"22": {"name": "安阳县"},
					"23": {"name": "汤阴县"},
					"26": {"name": "滑　县"},
					"27": {"name": "内黄县"},
					"81": {"name": "林州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "文峰区"},
					"03": {"name": "北关区"},
					"05": {"name": "殷都区"},
					"06": {"name": "龙安区"}
				}
			},
			"06": {
				"name": "鹤壁市",
				"content": {
					"11": {"name": "淇滨区"},
					"21": {"name": "浚　县"},
					"22": {"name": "淇　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "鹤山区"},
					"03": {"name": "山城区"}
				}
			},
			"07": {
				"name": "新乡市",
				"content": {
					"11": {"name": "牧野区"},
					"21": {"name": "新乡县"},
					"24": {"name": "获嘉县"},
					"25": {"name": "原阳县"},
					"26": {"name": "延津县"},
					"27": {"name": "封丘县"},
					"28": {"name": "长垣县"},
					"81": {"name": "卫辉市"},
					"82": {"name": "辉县市"},
					"01": {"name": "市辖区"},
					"02": {"name": "红旗区"},
					"03": {"name": "卫滨区"},
					"04": {"name": "凤泉区"}
				}
			},
			"08": {
				"name": "焦作市",
				"content": {
					"11": {"name": "山阳区"},
					"21": {"name": "修武县"},
					"22": {"name": "博爱县"},
					"23": {"name": "武陟县"},
					"25": {"name": "温　县"},
					"81": {"name": "济源市"},
					"82": {"name": "沁阳市"},
					"83": {"name": "孟州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "解放区"},
					"03": {"name": "中站区"},
					"04": {"name": "马村区"}
				}
			},
			"09": {
				"name": "濮阳市",
				"content": {
					"22": {"name": "清丰县"},
					"23": {"name": "南乐县"},
					"26": {"name": "范　县"},
					"27": {"name": "台前县"},
					"28": {"name": "濮阳县"},
					"01": {"name": "市辖区"},
					"02": {"name": "华龙区"}
				}
			}
		}
	},
	"42": {
		"name": "湖北省",
		"content": {
			"10": {
				"name": "荆州市",
				"content": {
					"22": {"name": "公安县"},
					"23": {"name": "监利县"},
					"24": {"name": "江陵县"},
					"81": {"name": "石首市"},
					"83": {"name": "洪湖市"},
					"87": {"name": "松滋市"},
					"01": {"name": "市辖区"},
					"02": {"name": "沙市区"},
					"03": {"name": "荆州区"}
				}
			},
			"11": {
				"name": "黄冈市",
				"content": {
					"21": {"name": "团风县"},
					"22": {"name": "红安县"},
					"23": {"name": "罗田县"},
					"24": {"name": "英山县"},
					"25": {"name": "浠水县"},
					"26": {"name": "蕲春县"},
					"27": {"name": "黄梅县"},
					"81": {"name": "麻城市"},
					"82": {"name": "武穴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "黄州区"}
				}
			},
			"12": {
				"name": "咸宁市",
				"content": {
					"21": {"name": "嘉鱼县"},
					"22": {"name": "通城县"},
					"23": {"name": "崇阳县"},
					"24": {"name": "通山县"},
					"81": {"name": "赤壁市"},
					"01": {"name": "市辖区"},
					"02": {"name": "咸安区"}
				}
			},
			"13": {"name": "随州市", "content": {"81": {"name": "广水市"}, "01": {"name": "市辖区"}, "02": {"name": "曾都区"}}},
			"28": {
				"name": "恩施土家族苗族自治州",
				"content": {
					"22": {"name": "建始县"},
					"23": {"name": "巴东县"},
					"25": {"name": "宣恩县"},
					"26": {"name": "咸丰县"},
					"27": {"name": "来凤县"},
					"28": {"name": "鹤峰县"},
					"01": {"name": "恩施市"},
					"02": {"name": "利川市"}
				}
			},
			"90": {
				"name": "省直辖行政单位",
				"content": {"21": {"name": "神农架林区"}, "04": {"name": "仙桃市"}, "05": {"name": "潜江市"}, "06": {"name": "天门市"}}
			},
			"01": {
				"name": "武汉市",
				"content": {
					"11": {"name": "洪山区"},
					"12": {"name": "东西湖区"},
					"13": {"name": "汉南区"},
					"14": {"name": "蔡甸区"},
					"15": {"name": "江夏区"},
					"16": {"name": "黄陂区"},
					"17": {"name": "新洲区"},
					"01": {"name": "市辖区"},
					"02": {"name": "江岸区"},
					"03": {"name": "江汉区"},
					"04": {"name": "乔口区"},
					"05": {"name": "汉阳区"},
					"06": {"name": "武昌区"},
					"07": {"name": "青山区"}
				}
			},
			"02": {
				"name": "黄石市",
				"content": {
					"22": {"name": "阳新县"},
					"81": {"name": "大冶市"},
					"01": {"name": "市辖区"},
					"02": {"name": "黄石港区"},
					"03": {"name": "西塞山区"},
					"04": {"name": "下陆区"},
					"05": {"name": "铁山区"}
				}
			},
			"03": {
				"name": "十堰市",
				"content": {
					"21": {"name": "郧　县"},
					"22": {"name": "郧西县"},
					"23": {"name": "竹山县"},
					"24": {"name": "竹溪县"},
					"25": {"name": "房　县"},
					"81": {"name": "丹江口市"},
					"01": {"name": "市辖区"},
					"02": {"name": "茅箭区"},
					"03": {"name": "张湾区"}
				}
			},
			"05": {
				"name": "宜昌市",
				"content": {
					"25": {"name": "远安县"},
					"26": {"name": "兴山县"},
					"27": {"name": "秭归县"},
					"28": {"name": "长阳土家族自治县"},
					"29": {"name": "五峰土家族自治县"},
					"81": {"name": "宜都市"},
					"82": {"name": "当阳市"},
					"83": {"name": "枝江市"},
					"01": {"name": "市辖区"},
					"02": {"name": "西陵区"},
					"03": {"name": "伍家岗区"},
					"04": {"name": "点军区"},
					"05": {"name": "猇亭区"},
					"06": {"name": "夷陵区"}
				}
			},
			"06": {
				"name": "襄樊市",
				"content": {
					"24": {"name": "南漳县"},
					"25": {"name": "谷城县"},
					"26": {"name": "保康县"},
					"82": {"name": "老河口市"},
					"83": {"name": "枣阳市"},
					"84": {"name": "宜城市"},
					"01": {"name": "市辖区"},
					"02": {"name": "襄城区"},
					"06": {"name": "樊城区"},
					"07": {"name": "襄阳区"}
				}
			},
			"07": {
				"name": "鄂州市",
				"content": {"01": {"name": "市辖区"}, "02": {"name": "梁子湖区"}, "03": {"name": "华容区"}, "04": {"name": "鄂城区"}}
			},
			"08": {
				"name": "荆门市",
				"content": {
					"21": {"name": "京山县"},
					"22": {"name": "沙洋县"},
					"81": {"name": "钟祥市"},
					"01": {"name": "市辖区"},
					"02": {"name": "东宝区"},
					"04": {"name": "掇刀区"}
				}
			},
			"09": {
				"name": "孝感市",
				"content": {
					"21": {"name": "孝昌县"},
					"22": {"name": "大悟县"},
					"23": {"name": "云梦县"},
					"81": {"name": "应城市"},
					"82": {"name": "安陆市"},
					"84": {"name": "汉川市"},
					"01": {"name": "市辖区"},
					"02": {"name": "孝南区"}
				}
			}
		}
	},
	"43": {
		"name": "湖南省",
		"content": {
			"10": {
				"name": "郴州市",
				"content": {
					"21": {"name": "桂阳县"},
					"22": {"name": "宜章县"},
					"23": {"name": "永兴县"},
					"24": {"name": "嘉禾县"},
					"25": {"name": "临武县"},
					"26": {"name": "汝城县"},
					"27": {"name": "桂东县"},
					"28": {"name": "安仁县"},
					"81": {"name": "资兴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "北湖区"},
					"03": {"name": "苏仙区"}
				}
			},
			"11": {
				"name": "永州市",
				"content": {
					"21": {"name": "祁阳县"},
					"22": {"name": "东安县"},
					"23": {"name": "双牌县"},
					"24": {"name": "道　县"},
					"25": {"name": "江永县"},
					"26": {"name": "宁远县"},
					"27": {"name": "蓝山县"},
					"28": {"name": "新田县"},
					"29": {"name": "江华瑶族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "芝山区"},
					"03": {"name": "冷水滩区"}
				}
			},
			"12": {
				"name": "怀化市",
				"content": {
					"21": {"name": "中方县"},
					"22": {"name": "沅陵县"},
					"23": {"name": "辰溪县"},
					"24": {"name": "溆浦县"},
					"25": {"name": "会同县"},
					"26": {"name": "麻阳苗族自治县"},
					"27": {"name": "新晃侗族自治县"},
					"28": {"name": "芷江侗族自治县"},
					"29": {"name": "靖州苗族侗族自治县"},
					"30": {"name": "通道侗族自治县"},
					"81": {"name": "洪江市"},
					"01": {"name": "市辖区"},
					"02": {"name": "鹤城区"}
				}
			},
			"13": {
				"name": "娄底市",
				"content": {
					"21": {"name": "双峰县"},
					"22": {"name": "新化县"},
					"81": {"name": "冷水江市"},
					"82": {"name": "涟源市"},
					"01": {"name": "市辖区"},
					"02": {"name": "娄星区"}
				}
			},
			"31": {
				"name": "湘西土家族苗族自治州",
				"content": {
					"22": {"name": "泸溪县"},
					"23": {"name": "凤凰县"},
					"24": {"name": "花垣县"},
					"25": {"name": "保靖县"},
					"26": {"name": "古丈县"},
					"27": {"name": "永顺县"},
					"30": {"name": "龙山县"},
					"01": {"name": "吉首市"}
				}
			},
			"01": {
				"name": "长沙市",
				"content": {
					"11": {"name": "雨花区"},
					"21": {"name": "长沙县"},
					"22": {"name": "望城县"},
					"24": {"name": "宁乡县"},
					"81": {"name": "浏阳市"},
					"01": {"name": "市辖区"},
					"02": {"name": "芙蓉区"},
					"03": {"name": "天心区"},
					"04": {"name": "岳麓区"},
					"05": {"name": "开福区"}
				}
			},
			"02": {
				"name": "株洲市",
				"content": {
					"11": {"name": "天元区"},
					"21": {"name": "株洲县"},
					"23": {"name": "攸　县"},
					"24": {"name": "茶陵县"},
					"25": {"name": "炎陵县"},
					"81": {"name": "醴陵市"},
					"01": {"name": "市辖区"},
					"02": {"name": "荷塘区"},
					"03": {"name": "芦淞区"},
					"04": {"name": "石峰区"}
				}
			},
			"03": {
				"name": "湘潭市",
				"content": {
					"21": {"name": "湘潭县"},
					"81": {"name": "湘乡市"},
					"82": {"name": "韶山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "雨湖区"},
					"04": {"name": "岳塘区"}
				}
			},
			"04": {
				"name": "衡阳市",
				"content": {
					"12": {"name": "南岳区"},
					"21": {"name": "衡阳县"},
					"22": {"name": "衡南县"},
					"23": {"name": "衡山县"},
					"24": {"name": "衡东县"},
					"26": {"name": "祁东县"},
					"81": {"name": "耒阳市"},
					"82": {"name": "常宁市"},
					"01": {"name": "市辖区"},
					"05": {"name": "珠晖区"},
					"06": {"name": "雁峰区"},
					"07": {"name": "石鼓区"},
					"08": {"name": "蒸湘区"}
				}
			},
			"05": {
				"name": "邵阳市",
				"content": {
					"11": {"name": "北塔区"},
					"21": {"name": "邵东县"},
					"22": {"name": "新邵县"},
					"23": {"name": "邵阳县"},
					"24": {"name": "隆回县"},
					"25": {"name": "洞口县"},
					"27": {"name": "绥宁县"},
					"28": {"name": "新宁县"},
					"29": {"name": "城步苗族自治县"},
					"81": {"name": "武冈市"},
					"01": {"name": "市辖区"},
					"02": {"name": "双清区"},
					"03": {"name": "大祥区"}
				}
			},
			"06": {
				"name": "岳阳市",
				"content": {
					"11": {"name": "君山区"},
					"21": {"name": "岳阳县"},
					"23": {"name": "华容县"},
					"24": {"name": "湘阴县"},
					"26": {"name": "平江县"},
					"81": {"name": "汨罗市"},
					"82": {"name": "临湘市"},
					"01": {"name": "市辖区"},
					"02": {"name": "岳阳楼区"},
					"03": {"name": "云溪区"}
				}
			},
			"07": {
				"name": "常德市",
				"content": {
					"21": {"name": "安乡县"},
					"22": {"name": "汉寿县"},
					"23": {"name": "澧　县"},
					"24": {"name": "临澧县"},
					"25": {"name": "桃源县"},
					"26": {"name": "石门县"},
					"81": {"name": "津市市"},
					"01": {"name": "市辖区"},
					"02": {"name": "武陵区"},
					"03": {"name": "鼎城区"}
				}
			},
			"08": {
				"name": "张家界市",
				"content": {
					"11": {"name": "武陵源区"},
					"21": {"name": "慈利县"},
					"22": {"name": "桑植县"},
					"01": {"name": "市辖区"},
					"02": {"name": "永定区"}
				}
			},
			"09": {
				"name": "益阳市",
				"content": {
					"21": {"name": "南　县"},
					"22": {"name": "桃江县"},
					"23": {"name": "安化县"},
					"81": {"name": "沅江市"},
					"01": {"name": "市辖区"},
					"02": {"name": "资阳区"},
					"03": {"name": "赫山区"}
				}
			}
		}
	},
	"44": {
		"name": "广东省",
		"content": {
			"12": {
				"name": "肇庆市",
				"content": {
					"23": {"name": "广宁县"},
					"24": {"name": "怀集县"},
					"25": {"name": "封开县"},
					"26": {"name": "德庆县"},
					"83": {"name": "高要市"},
					"84": {"name": "四会市"},
					"01": {"name": "市辖区"},
					"02": {"name": "端州区"},
					"03": {"name": "鼎湖区"}
				}
			},
			"13": {
				"name": "惠州市",
				"content": {
					"22": {"name": "博罗县"},
					"23": {"name": "惠东县"},
					"24": {"name": "龙门县"},
					"01": {"name": "市辖区"},
					"02": {"name": "惠城区"},
					"03": {"name": "惠阳区"}
				}
			},
			"14": {
				"name": "梅州市",
				"content": {
					"21": {"name": "梅　县"},
					"22": {"name": "大埔县"},
					"23": {"name": "丰顺县"},
					"24": {"name": "五华县"},
					"26": {"name": "平远县"},
					"27": {"name": "蕉岭县"},
					"81": {"name": "兴宁市"},
					"01": {"name": "市辖区"},
					"02": {"name": "梅江区"}
				}
			},
			"15": {
				"name": "汕尾市",
				"content": {
					"21": {"name": "海丰县"},
					"23": {"name": "陆河县"},
					"81": {"name": "陆丰市"},
					"01": {"name": "市辖区"},
					"02": {"name": "城　区"}
				}
			},
			"16": {
				"name": "河源市",
				"content": {
					"21": {"name": "紫金县"},
					"22": {"name": "龙川县"},
					"23": {"name": "连平县"},
					"24": {"name": "和平县"},
					"25": {"name": "东源县"},
					"01": {"name": "市辖区"},
					"02": {"name": "源城区"}
				}
			},
			"17": {
				"name": "阳江市",
				"content": {
					"21": {"name": "阳西县"},
					"23": {"name": "阳东县"},
					"81": {"name": "阳春市"},
					"01": {"name": "市辖区"},
					"02": {"name": "江城区"}
				}
			},
			"18": {
				"name": "清远市",
				"content": {
					"21": {"name": "佛冈县"},
					"23": {"name": "阳山县"},
					"25": {"name": "连山壮族瑶族自治县"},
					"26": {"name": "连南瑶族自治县"},
					"27": {"name": "清新县"},
					"81": {"name": "英德市"},
					"82": {"name": "连州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "清城区"}
				}
			},
			"19": {"name": "东莞市", "content": {}},
			"20": {"name": "中山市", "content": {}},
			"51": {
				"name": "潮州市",
				"content": {"21": {"name": "潮安县"}, "22": {"name": "饶平县"}, "01": {"name": "市辖区"}, "02": {"name": "湘桥区"}}
			},
			"52": {
				"name": "揭阳市",
				"content": {
					"21": {"name": "揭东县"},
					"22": {"name": "揭西县"},
					"24": {"name": "惠来县"},
					"81": {"name": "普宁市"},
					"01": {"name": "市辖区"},
					"02": {"name": "榕城区"}
				}
			},
			"53": {
				"name": "云浮市",
				"content": {
					"21": {"name": "新兴县"},
					"22": {"name": "郁南县"},
					"23": {"name": "云安县"},
					"81": {"name": "罗定市"},
					"01": {"name": "市辖区"},
					"02": {"name": "云城区"}
				}
			},
			"01": {
				"name": "广州市",
				"content": {
					"11": {"name": "白云区"},
					"12": {"name": "黄埔区"},
					"13": {"name": "番禺区"},
					"14": {"name": "花都区"},
					"83": {"name": "增城市"},
					"84": {"name": "从化市"},
					"01": {"name": "市辖区"},
					"02": {"name": "东山区"},
					"03": {"name": "荔湾区"},
					"04": {"name": "越秀区"},
					"05": {"name": "海珠区"},
					"06": {"name": "天河区"},
					"07": {"name": "芳村区"}
				}
			},
			"02": {
				"name": "韶关市",
				"content": {
					"22": {"name": "始兴县"},
					"24": {"name": "仁化县"},
					"29": {"name": "翁源县"},
					"32": {"name": "乳源瑶族自治县"},
					"33": {"name": "新丰县"},
					"81": {"name": "乐昌市"},
					"82": {"name": "南雄市"},
					"01": {"name": "市辖区"},
					"03": {"name": "武江区"},
					"04": {"name": "浈江区"},
					"05": {"name": "曲江区"}
				}
			},
			"03": {
				"name": "深圳市",
				"content": {
					"01": {"name": "市辖区"},
					"03": {"name": "罗湖区"},
					"04": {"name": "福田区"},
					"05": {"name": "南山区"},
					"06": {"name": "宝安区"},
					"07": {"name": "龙岗区"},
					"08": {"name": "盐田区"}
				}
			},
			"04": {
				"name": "珠海市",
				"content": {"01": {"name": "市辖区"}, "02": {"name": "香洲区"}, "03": {"name": "斗门区"}, "04": {"name": "金湾区"}}
			},
			"05": {
				"name": "汕头市",
				"content": {
					"11": {"name": "金平区"},
					"12": {"name": "濠江区"},
					"13": {"name": "潮阳区"},
					"14": {"name": "潮南区"},
					"15": {"name": "澄海区"},
					"23": {"name": "南澳县"},
					"01": {"name": "市辖区"},
					"07": {"name": "龙湖区"}
				}
			},
			"06": {
				"name": "佛山市",
				"content": {
					"01": {"name": "市辖区"},
					"04": {"name": "禅城区"},
					"05": {"name": "南海区"},
					"06": {"name": "顺德区"},
					"07": {"name": "三水区"},
					"08": {"name": "高明区"}
				}
			},
			"07": {
				"name": "江门市",
				"content": {
					"81": {"name": "台山市"},
					"83": {"name": "开平市"},
					"84": {"name": "鹤山市"},
					"85": {"name": "恩平市"},
					"01": {"name": "市辖区"},
					"03": {"name": "蓬江区"},
					"04": {"name": "江海区"},
					"05": {"name": "新会区"}
				}
			},
			"08": {
				"name": "湛江市",
				"content": {
					"11": {"name": "麻章区"},
					"23": {"name": "遂溪县"},
					"25": {"name": "徐闻县"},
					"81": {"name": "廉江市"},
					"82": {"name": "雷州市"},
					"83": {"name": "吴川市"},
					"01": {"name": "市辖区"},
					"02": {"name": "赤坎区"},
					"03": {"name": "霞山区"},
					"04": {"name": "坡头区"}
				}
			},
			"09": {
				"name": "茂名市",
				"content": {
					"23": {"name": "电白县"},
					"81": {"name": "高州市"},
					"82": {"name": "化州市"},
					"83": {"name": "信宜市"},
					"01": {"name": "市辖区"},
					"02": {"name": "茂南区"},
					"03": {"name": "茂港区"}
				}
			}
		}
	},
	"45": {
		"name": "广西省",
		"content": {
			"10": {
				"name": "百色市",
				"content": {
					"21": {"name": "田阳县"},
					"22": {"name": "田东县"},
					"23": {"name": "平果县"},
					"24": {"name": "德保县"},
					"25": {"name": "靖西县"},
					"26": {"name": "那坡县"},
					"27": {"name": "凌云县"},
					"28": {"name": "乐业县"},
					"29": {"name": "田林县"},
					"30": {"name": "西林县"},
					"31": {"name": "隆林各族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "右江区"}
				}
			},
			"11": {
				"name": "贺州市",
				"content": {
					"21": {"name": "昭平县"},
					"22": {"name": "钟山县"},
					"23": {"name": "富川瑶族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "八步区"}
				}
			},
			"12": {
				"name": "河池市",
				"content": {
					"21": {"name": "南丹县"},
					"22": {"name": "天峨县"},
					"23": {"name": "凤山县"},
					"24": {"name": "东兰县"},
					"25": {"name": "罗城仫佬族自治县"},
					"26": {"name": "环江毛南族自治县"},
					"27": {"name": "巴马瑶族自治县"},
					"28": {"name": "都安瑶族自治县"},
					"29": {"name": "大化瑶族自治县"},
					"81": {"name": "宜州市"},
					"01": {"name": "市辖区"},
					"02": {"name": "金城江区"}
				}
			},
			"13": {
				"name": "来宾市",
				"content": {
					"21": {"name": "忻城县"},
					"22": {"name": "象州县"},
					"23": {"name": "武宣县"},
					"24": {"name": "金秀瑶族自治县"},
					"81": {"name": "合山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "兴宾区"}
				}
			},
			"14": {
				"name": "崇左市",
				"content": {
					"21": {"name": "扶绥县"},
					"22": {"name": "宁明县"},
					"23": {"name": "龙州县"},
					"24": {"name": "大新县"},
					"25": {"name": "天等县"},
					"81": {"name": "凭祥市"},
					"01": {"name": "市辖区"},
					"02": {"name": "江洲区"}
				}
			},
			"01": {
				"name": "南宁市",
				"content": {
					"22": {"name": "武鸣县"},
					"23": {"name": "隆安县"},
					"24": {"name": "马山县"},
					"25": {"name": "上林县"},
					"26": {"name": "宾阳县"},
					"27": {"name": "横　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "兴宁区"},
					"03": {"name": "青秀区"},
					"05": {"name": "江南区"},
					"07": {"name": "西乡塘区"},
					"08": {"name": "良庆区"},
					"09": {"name": "邕宁区"}
				}
			},
			"02": {
				"name": "柳州市",
				"content": {
					"21": {"name": "柳江县"},
					"22": {"name": "柳城县"},
					"23": {"name": "鹿寨县"},
					"24": {"name": "融安县"},
					"25": {"name": "融水苗族自治县"},
					"26": {"name": "三江侗族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城中区"},
					"03": {"name": "鱼峰区"},
					"04": {"name": "柳南区"},
					"05": {"name": "柳北区"}
				}
			},
			"03": {
				"name": "桂林市",
				"content": {
					"11": {"name": "雁山区"},
					"21": {"name": "阳朔县"},
					"22": {"name": "临桂县"},
					"23": {"name": "灵川县"},
					"24": {"name": "全州县"},
					"25": {"name": "兴安县"},
					"26": {"name": "永福县"},
					"27": {"name": "灌阳县"},
					"28": {"name": "龙胜各族自治县"},
					"29": {"name": "资源县"},
					"30": {"name": "平乐县"},
					"31": {"name": "荔蒲县"},
					"32": {"name": "恭城瑶族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "秀峰区"},
					"03": {"name": "叠彩区"},
					"04": {"name": "象山区"},
					"05": {"name": "七星区"}
				}
			},
			"04": {
				"name": "梧州市",
				"content": {
					"21": {"name": "苍梧县"},
					"22": {"name": "藤　县"},
					"23": {"name": "蒙山县"},
					"81": {"name": "岑溪市"},
					"01": {"name": "市辖区"},
					"03": {"name": "万秀区"},
					"04": {"name": "蝶山区"},
					"05": {"name": "长洲区"}
				}
			},
			"05": {
				"name": "北海市",
				"content": {
					"12": {"name": "铁山港区"},
					"21": {"name": "合浦县"},
					"01": {"name": "市辖区"},
					"02": {"name": "海城区"},
					"03": {"name": "银海区"}
				}
			},
			"06": {
				"name": "防城港市",
				"content": {
					"21": {"name": "上思县"},
					"81": {"name": "东兴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "港口区"},
					"03": {"name": "防城区"}
				}
			},
			"07": {
				"name": "钦州市",
				"content": {
					"21": {"name": "灵山县"},
					"22": {"name": "浦北县"},
					"01": {"name": "市辖区"},
					"02": {"name": "钦南区"},
					"03": {"name": "钦北区"}
				}
			},
			"08": {
				"name": "贵港市",
				"content": {
					"21": {"name": "平南县"},
					"81": {"name": "桂平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "港北区"},
					"03": {"name": "港南区"},
					"04": {"name": "覃塘区"}
				}
			},
			"09": {
				"name": "玉林市",
				"content": {
					"21": {"name": "容　县"},
					"22": {"name": "陆川县"},
					"23": {"name": "博白县"},
					"24": {"name": "兴业县"},
					"81": {"name": "北流市"},
					"01": {"name": "市辖区"},
					"02": {"name": "玉州区"}
				}
			}
		}
	},
	"46": {
		"name": "海南省",
		"content": {
			"90": {
				"name": "省直辖县级行政单位",
				"content": {
					"25": {"name": "定安县"},
					"26": {"name": "屯昌县"},
					"27": {"name": "澄迈县"},
					"28": {"name": "临高县"},
					"30": {"name": "白沙黎族自治县"},
					"31": {"name": "昌江黎族自治县"},
					"33": {"name": "乐东黎族自治县"},
					"34": {"name": "陵水黎族自治县"},
					"35": {"name": "保亭黎族苗族自治县"},
					"36": {"name": "琼中黎族苗族自治县"},
					"37": {"name": "西沙群岛"},
					"38": {"name": "南沙群岛"},
					"39": {"name": "中沙群岛的岛礁及其海域"},
					"01": {"name": "五指山市"},
					"02": {"name": "琼海市"},
					"03": {"name": "儋州市"},
					"05": {"name": "文昌市"},
					"06": {"name": "万宁市"},
					"07": {"name": "东方市"}
				}
			},
			"01": {
				"name": "海口市",
				"content": {
					"01": {"name": "市辖区"},
					"05": {"name": "秀英区"},
					"06": {"name": "龙华区"},
					"07": {"name": "琼山区"},
					"08": {"name": "美兰区"}
				}
			},
			"02": {"name": "三亚市", "content": {"01": {"name": "市辖区"}}}
		}
	},
	"50": {
		"name": "重庆市",
		"content": {
			"01": {
				"name": "市辖区",
				"content": {
					"10": {"name": "万盛区"},
					"11": {"name": "双桥区"},
					"12": {"name": "渝北区"},
					"13": {"name": "巴南区"},
					"14": {"name": "黔江区"},
					"15": {"name": "长寿区"},
					"01": {"name": "万州区"},
					"02": {"name": "涪陵区"},
					"03": {"name": "渝中区"},
					"04": {"name": "大渡口区"},
					"05": {"name": "江北区"},
					"06": {"name": "沙坪坝区"},
					"07": {"name": "九龙坡区"},
					"08": {"name": "南岸区"},
					"09": {"name": "北碚区"}
				}
			},
			"02": {
				"name": "县",
				"content": {
					"22": {"name": "綦江县"},
					"23": {"name": "潼南县"},
					"24": {"name": "铜梁县"},
					"25": {"name": "大足县"},
					"26": {"name": "荣昌县"},
					"27": {"name": "璧山县"},
					"28": {"name": "梁平县"},
					"29": {"name": "城口县"},
					"30": {"name": "丰都县"},
					"31": {"name": "垫江县"},
					"32": {"name": "武隆县"},
					"33": {"name": "忠　县"},
					"34": {"name": "开　县"},
					"35": {"name": "云阳县"},
					"36": {"name": "奉节县"},
					"37": {"name": "巫山县"},
					"38": {"name": "巫溪县"},
					"40": {"name": "石柱土家族自治县"},
					"41": {"name": "秀山土家族苗族自治县"},
					"42": {"name": "酉阳土家族苗族自治县"},
					"43": {"name": "彭水苗族土家族自治县"}
				}
			},
			"03": {
				"name": "市",
				"content": {"81": {"name": "江津市"}, "82": {"name": "合川市"}, "83": {"name": "永川市"}, "84": {"name": "南川市"}}
			}
		}
	},
	"51": {
		"name": "四川省",
		"content": {
			"10": {
				"name": "内江市",
				"content": {
					"11": {"name": "东兴区"},
					"24": {"name": "威远县"},
					"25": {"name": "资中县"},
					"28": {"name": "隆昌县"},
					"01": {"name": "市辖区"},
					"02": {"name": "市中区"}
				}
			},
			"11": {
				"name": "乐山市",
				"content": {
					"11": {"name": "沙湾区"},
					"12": {"name": "五通桥区"},
					"13": {"name": "金口河区"},
					"23": {"name": "犍为县"},
					"24": {"name": "井研县"},
					"26": {"name": "夹江县"},
					"29": {"name": "沐川县"},
					"32": {"name": "峨边彝族自治县"},
					"33": {"name": "马边彝族自治县"},
					"81": {"name": "峨眉山市"},
					"01": {"name": "市辖区"},
					"02": {"name": "市中区"}
				}
			},
			"13": {
				"name": "南充市",
				"content": {
					"21": {"name": "南部县"},
					"22": {"name": "营山县"},
					"23": {"name": "蓬安县"},
					"24": {"name": "仪陇县"},
					"25": {"name": "西充县"},
					"81": {"name": "阆中市"},
					"01": {"name": "市辖区"},
					"02": {"name": "顺庆区"},
					"03": {"name": "高坪区"},
					"04": {"name": "嘉陵区"}
				}
			},
			"14": {
				"name": "眉山市",
				"content": {
					"21": {"name": "仁寿县"},
					"22": {"name": "彭山县"},
					"23": {"name": "洪雅县"},
					"24": {"name": "丹棱县"},
					"25": {"name": "青神县"},
					"01": {"name": "市辖区"},
					"02": {"name": "东坡区"}
				}
			},
			"15": {
				"name": "宜宾市",
				"content": {
					"21": {"name": "宜宾县"},
					"22": {"name": "南溪县"},
					"23": {"name": "江安县"},
					"24": {"name": "长宁县"},
					"25": {"name": "高　县"},
					"26": {"name": "珙　县"},
					"27": {"name": "筠连县"},
					"28": {"name": "兴文县"},
					"29": {"name": "屏山县"},
					"01": {"name": "市辖区"},
					"02": {"name": "翠屏区"}
				}
			},
			"16": {
				"name": "广安市",
				"content": {
					"21": {"name": "岳池县"},
					"22": {"name": "武胜县"},
					"23": {"name": "邻水县"},
					"81": {"name": "华莹市"},
					"01": {"name": "市辖区"},
					"02": {"name": "广安区"}
				}
			},
			"17": {
				"name": "达州市",
				"content": {
					"21": {"name": "达　县"},
					"22": {"name": "宣汉县"},
					"23": {"name": "开江县"},
					"24": {"name": "大竹县"},
					"25": {"name": "渠　县"},
					"81": {"name": "万源市"},
					"01": {"name": "市辖区"},
					"02": {"name": "通川区"}
				}
			},
			"18": {
				"name": "雅安市",
				"content": {
					"21": {"name": "名山县"},
					"22": {"name": "荥经县"},
					"23": {"name": "汉源县"},
					"24": {"name": "石棉县"},
					"25": {"name": "天全县"},
					"26": {"name": "芦山县"},
					"27": {"name": "宝兴县"},
					"01": {"name": "市辖区"},
					"02": {"name": "雨城区"}
				}
			},
			"19": {
				"name": "巴中市",
				"content": {
					"21": {"name": "通江县"},
					"22": {"name": "南江县"},
					"23": {"name": "平昌县"},
					"01": {"name": "市辖区"},
					"02": {"name": "巴州区"}
				}
			},
			"20": {
				"name": "资阳市",
				"content": {
					"21": {"name": "安岳县"},
					"22": {"name": "乐至县"},
					"81": {"name": "简阳市"},
					"01": {"name": "市辖区"},
					"02": {"name": "雁江区"}
				}
			},
			"32": {
				"name": "阿坝藏族羌族自治州",
				"content": {
					"21": {"name": "汶川县"},
					"22": {"name": "理　县"},
					"23": {"name": "茂　县"},
					"24": {"name": "松潘县"},
					"25": {"name": "九寨沟县"},
					"26": {"name": "金川县"},
					"27": {"name": "小金县"},
					"28": {"name": "黑水县"},
					"29": {"name": "马尔康县"},
					"30": {"name": "壤塘县"},
					"31": {"name": "阿坝县"},
					"32": {"name": "若尔盖县"},
					"33": {"name": "红原县"}
				}
			},
			"33": {
				"name": "甘孜藏族自治州",
				"content": {
					"21": {"name": "康定县"},
					"22": {"name": "泸定县"},
					"23": {"name": "丹巴县"},
					"24": {"name": "九龙县"},
					"25": {"name": "雅江县"},
					"26": {"name": "道孚县"},
					"27": {"name": "炉霍县"},
					"28": {"name": "甘孜县"},
					"29": {"name": "新龙县"},
					"30": {"name": "德格县"},
					"31": {"name": "白玉县"},
					"32": {"name": "石渠县"},
					"33": {"name": "色达县"},
					"34": {"name": "理塘县"},
					"35": {"name": "巴塘县"},
					"36": {"name": "乡城县"},
					"37": {"name": "稻城县"},
					"38": {"name": "得荣县"}
				}
			},
			"34": {
				"name": "凉山彝族自治州",
				"content": {
					"22": {"name": "木里藏族自治县"},
					"23": {"name": "盐源县"},
					"24": {"name": "德昌县"},
					"25": {"name": "会理县"},
					"26": {"name": "会东县"},
					"27": {"name": "宁南县"},
					"28": {"name": "普格县"},
					"29": {"name": "布拖县"},
					"30": {"name": "金阳县"},
					"31": {"name": "昭觉县"},
					"32": {"name": "喜德县"},
					"33": {"name": "冕宁县"},
					"34": {"name": "越西县"},
					"35": {"name": "甘洛县"},
					"36": {"name": "美姑县"},
					"37": {"name": "雷波县"},
					"01": {"name": "西昌市"}
				}
			},
			"01": {
				"name": "成都市",
				"content": {
					"12": {"name": "龙泉驿区"},
					"13": {"name": "青白江区"},
					"14": {"name": "新都区"},
					"15": {"name": "温江区"},
					"21": {"name": "金堂县"},
					"22": {"name": "双流县"},
					"24": {"name": "郫　县"},
					"29": {"name": "大邑县"},
					"31": {"name": "蒲江县"},
					"32": {"name": "新津县"},
					"81": {"name": "都江堰市"},
					"82": {"name": "彭州市"},
					"83": {"name": "邛崃市"},
					"84": {"name": "崇州市"},
					"01": {"name": "市辖区"},
					"04": {"name": "锦江区"},
					"05": {"name": "青羊区"},
					"06": {"name": "金牛区"},
					"07": {"name": "武侯区"},
					"08": {"name": "成华区"}
				}
			},
			"03": {
				"name": "自贡市",
				"content": {
					"11": {"name": "沿滩区"},
					"21": {"name": "荣　县"},
					"22": {"name": "富顺县"},
					"01": {"name": "市辖区"},
					"02": {"name": "自流井区"},
					"03": {"name": "贡井区"},
					"04": {"name": "大安区"}
				}
			},
			"04": {
				"name": "攀枝花市",
				"content": {
					"11": {"name": "仁和区"},
					"21": {"name": "米易县"},
					"22": {"name": "盐边县"},
					"01": {"name": "市辖区"},
					"02": {"name": "东　区"},
					"03": {"name": "西　区"}
				}
			},
			"05": {
				"name": "泸州市",
				"content": {
					"21": {"name": "泸　县"},
					"22": {"name": "合江县"},
					"24": {"name": "叙永县"},
					"25": {"name": "古蔺县"},
					"01": {"name": "市辖区"},
					"02": {"name": "江阳区"},
					"03": {"name": "纳溪区"},
					"04": {"name": "龙马潭区"}
				}
			},
			"06": {
				"name": "德阳市",
				"content": {
					"23": {"name": "中江县"},
					"26": {"name": "罗江县"},
					"81": {"name": "广汉市"},
					"82": {"name": "什邡市"},
					"83": {"name": "绵竹市"},
					"01": {"name": "市辖区"},
					"03": {"name": "旌阳区"}
				}
			},
			"07": {
				"name": "绵阳市",
				"content": {
					"22": {"name": "三台县"},
					"23": {"name": "盐亭县"},
					"24": {"name": "安　县"},
					"25": {"name": "梓潼县"},
					"26": {"name": "北川羌族自治县"},
					"27": {"name": "平武县"},
					"81": {"name": "江油市"},
					"01": {"name": "市辖区"},
					"03": {"name": "涪城区"},
					"04": {"name": "游仙区"}
				}
			},
			"08": {
				"name": "广元市",
				"content": {
					"11": {"name": "元坝区"},
					"12": {"name": "朝天区"},
					"21": {"name": "旺苍县"},
					"22": {"name": "青川县"},
					"23": {"name": "剑阁县"},
					"24": {"name": "苍溪县"},
					"01": {"name": "市辖区"},
					"02": {"name": "市中区"}
				}
			},
			"09": {
				"name": "遂宁市",
				"content": {
					"21": {"name": "蓬溪县"},
					"22": {"name": "射洪县"},
					"23": {"name": "大英县"},
					"01": {"name": "市辖区"},
					"03": {"name": "船山区"},
					"04": {"name": "安居区"}
				}
			}
		}
	},
	"52": {
		"name": "贵州省",
		"content": {
			"22": {
				"name": "铜仁地区",
				"content": {
					"22": {"name": "江口县"},
					"23": {"name": "玉屏侗族自治县"},
					"24": {"name": "石阡县"},
					"25": {"name": "思南县"},
					"26": {"name": "印江土家族苗族自治县"},
					"27": {"name": "德江县"},
					"28": {"name": "沿河土家族自治县"},
					"29": {"name": "松桃苗族自治县"},
					"30": {"name": "万山特区"},
					"01": {"name": "铜仁市"}
				}
			},
			"23": {
				"name": "黔西南布依族苗族自治州",
				"content": {
					"22": {"name": "兴仁县"},
					"23": {"name": "普安县"},
					"24": {"name": "晴隆县"},
					"25": {"name": "贞丰县"},
					"26": {"name": "望谟县"},
					"27": {"name": "册亨县"},
					"28": {"name": "安龙县"},
					"01": {"name": "兴义市"}
				}
			},
			"24": {
				"name": "毕节地区",
				"content": {
					"22": {"name": "大方县"},
					"23": {"name": "黔西县"},
					"24": {"name": "金沙县"},
					"25": {"name": "织金县"},
					"26": {"name": "纳雍县"},
					"27": {"name": "威宁彝族回族苗族自治县"},
					"28": {"name": "赫章县"},
					"01": {"name": "毕节市"}
				}
			},
			"26": {
				"name": "黔东南苗族侗族自治州",
				"content": {
					"22": {"name": "黄平县"},
					"23": {"name": "施秉县"},
					"24": {"name": "三穗县"},
					"25": {"name": "镇远县"},
					"26": {"name": "岑巩县"},
					"27": {"name": "天柱县"},
					"28": {"name": "锦屏县"},
					"29": {"name": "剑河县"},
					"30": {"name": "台江县"},
					"31": {"name": "黎平县"},
					"32": {"name": "榕江县"},
					"33": {"name": "从江县"},
					"34": {"name": "雷山县"},
					"35": {"name": "麻江县"},
					"36": {"name": "丹寨县"},
					"01": {"name": "凯里市"}
				}
			},
			"27": {
				"name": "黔南布依族苗族自治州",
				"content": {
					"22": {"name": "荔波县"},
					"23": {"name": "贵定县"},
					"25": {"name": "瓮安县"},
					"26": {"name": "独山县"},
					"27": {"name": "平塘县"},
					"28": {"name": "罗甸县"},
					"29": {"name": "长顺县"},
					"30": {"name": "龙里县"},
					"31": {"name": "惠水县"},
					"32": {"name": "三都水族自治县"},
					"01": {"name": "都匀市"},
					"02": {"name": "福泉市"}
				}
			},
			"01": {
				"name": "贵阳市",
				"content": {
					"11": {"name": "花溪区"},
					"12": {"name": "乌当区"},
					"13": {"name": "白云区"},
					"14": {"name": "小河区"},
					"21": {"name": "开阳县"},
					"22": {"name": "息烽县"},
					"23": {"name": "修文县"},
					"81": {"name": "清镇市"},
					"01": {"name": "市辖区"},
					"02": {"name": "南明区"},
					"03": {"name": "云岩区"}
				}
			},
			"02": {
				"name": "六盘水市",
				"content": {"21": {"name": "水城县"}, "22": {"name": "盘　县"}, "01": {"name": "钟山区"}, "03": {"name": "六枝特区"}}
			},
			"03": {
				"name": "遵义市",
				"content": {
					"21": {"name": "遵义县"},
					"22": {"name": "桐梓县"},
					"23": {"name": "绥阳县"},
					"24": {"name": "正安县"},
					"25": {"name": "道真仡佬族苗族自治县"},
					"26": {"name": "务川仡佬族苗族自治县"},
					"27": {"name": "凤冈县"},
					"28": {"name": "湄潭县"},
					"29": {"name": "余庆县"},
					"30": {"name": "习水县"},
					"81": {"name": "赤水市"},
					"82": {"name": "仁怀市"},
					"01": {"name": "市辖区"},
					"02": {"name": "红花岗区"},
					"03": {"name": "汇川区"}
				}
			},
			"04": {
				"name": "安顺市",
				"content": {
					"21": {"name": "平坝县"},
					"22": {"name": "普定县"},
					"23": {"name": "镇宁布依族苗族自治县"},
					"24": {"name": "关岭布依族苗族自治县"},
					"25": {"name": "紫云苗族布依族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "西秀区"}
				}
			}
		}
	},
	"53": {
		"name": "云南省",
		"content": {
			"23": {
				"name": "楚雄彝族自治州",
				"content": {
					"22": {"name": "双柏县"},
					"23": {"name": "牟定县"},
					"24": {"name": "南华县"},
					"25": {"name": "姚安县"},
					"26": {"name": "大姚县"},
					"27": {"name": "永仁县"},
					"28": {"name": "元谋县"},
					"29": {"name": "武定县"},
					"31": {"name": "禄丰县"},
					"01": {"name": "楚雄市"}
				}
			},
			"25": {
				"name": "红河哈尼族彝族自治州",
				"content": {
					"22": {"name": "蒙自县"},
					"23": {"name": "屏边苗族自治县"},
					"24": {"name": "建水县"},
					"25": {"name": "石屏县"},
					"26": {"name": "弥勒县"},
					"27": {"name": "泸西县"},
					"28": {"name": "元阳县"},
					"29": {"name": "红河县"},
					"30": {"name": "金平苗族瑶族傣族自治县"},
					"31": {"name": "绿春县"},
					"32": {"name": "河口瑶族自治县"},
					"01": {"name": "个旧市"},
					"02": {"name": "开远市"}
				}
			},
			"26": {
				"name": "文山壮族苗族自治州",
				"content": {
					"21": {"name": "文山县"},
					"22": {"name": "砚山县"},
					"23": {"name": "西畴县"},
					"24": {"name": "麻栗坡县"},
					"25": {"name": "马关县"},
					"26": {"name": "丘北县"},
					"27": {"name": "广南县"},
					"28": {"name": "富宁县"}
				}
			},
			"28": {"name": "西双版纳傣族自治州", "content": {"22": {"name": "勐海县"}, "23": {"name": "勐腊县"}, "01": {"name": "景洪市"}}},
			"29": {
				"name": "大理白族自治州",
				"content": {
					"22": {"name": "漾濞彝族自治县"},
					"23": {"name": "祥云县"},
					"24": {"name": "宾川县"},
					"25": {"name": "弥渡县"},
					"26": {"name": "南涧彝族自治县"},
					"27": {"name": "巍山彝族回族自治县"},
					"28": {"name": "永平县"},
					"29": {"name": "云龙县"},
					"30": {"name": "洱源县"},
					"31": {"name": "剑川县"},
					"32": {"name": "鹤庆县"},
					"01": {"name": "大理市"}
				}
			},
			"31": {
				"name": "德宏傣族景颇族自治州",
				"content": {
					"22": {"name": "梁河县"},
					"23": {"name": "盈江县"},
					"24": {"name": "陇川县"},
					"02": {"name": "瑞丽市"},
					"03": {"name": "潞西市"}
				}
			},
			"33": {
				"name": "怒江傈僳族自治州",
				"content": {
					"21": {"name": "泸水县"},
					"23": {"name": "福贡县"},
					"24": {"name": "贡山独龙族怒族自治县"},
					"25": {"name": "兰坪白族普米族自治县"}
				}
			},
			"34": {
				"name": "迪庆藏族自治州",
				"content": {"21": {"name": "香格里拉县"}, "22": {"name": "德钦县"}, "23": {"name": "维西傈僳族自治县"}}
			},
			"01": {
				"name": "昆明市",
				"content": {
					"11": {"name": "官渡区"},
					"12": {"name": "西山区"},
					"13": {"name": "东川区"},
					"21": {"name": "呈贡县"},
					"22": {"name": "晋宁县"},
					"24": {"name": "富民县"},
					"25": {"name": "宜良县"},
					"26": {"name": "石林彝族自治县"},
					"27": {"name": "嵩明县"},
					"28": {"name": "禄劝彝族苗族自治县"},
					"29": {"name": "寻甸回族彝族自治县"},
					"81": {"name": "安宁市"},
					"01": {"name": "市辖区"},
					"02": {"name": "五华区"},
					"03": {"name": "盘龙区"}
				}
			},
			"03": {
				"name": "曲靖市",
				"content": {
					"21": {"name": "马龙县"},
					"22": {"name": "陆良县"},
					"23": {"name": "师宗县"},
					"24": {"name": "罗平县"},
					"25": {"name": "富源县"},
					"26": {"name": "会泽县"},
					"28": {"name": "沾益县"},
					"81": {"name": "宣威市"},
					"01": {"name": "市辖区"},
					"02": {"name": "麒麟区"}
				}
			},
			"04": {
				"name": "玉溪市",
				"content": {
					"21": {"name": "江川县"},
					"22": {"name": "澄江县"},
					"23": {"name": "通海县"},
					"24": {"name": "华宁县"},
					"25": {"name": "易门县"},
					"26": {"name": "峨山彝族自治县"},
					"27": {"name": "新平彝族傣族自治县"},
					"28": {"name": "元江哈尼族彝族傣族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "红塔区"}
				}
			},
			"05": {
				"name": "保山市",
				"content": {
					"21": {"name": "施甸县"},
					"22": {"name": "腾冲县"},
					"23": {"name": "龙陵县"},
					"24": {"name": "昌宁县"},
					"01": {"name": "市辖区"},
					"02": {"name": "隆阳区"}
				}
			},
			"06": {
				"name": "昭通市",
				"content": {
					"21": {"name": "鲁甸县"},
					"22": {"name": "巧家县"},
					"23": {"name": "盐津县"},
					"24": {"name": "大关县"},
					"25": {"name": "永善县"},
					"26": {"name": "绥江县"},
					"27": {"name": "镇雄县"},
					"28": {"name": "彝良县"},
					"29": {"name": "威信县"},
					"30": {"name": "水富县"},
					"01": {"name": "市辖区"},
					"02": {"name": "昭阳区"}
				}
			},
			"07": {
				"name": "丽江市",
				"content": {
					"21": {"name": "玉龙纳西族自治县"},
					"22": {"name": "永胜县"},
					"23": {"name": "华坪县"},
					"24": {"name": "宁蒗彝族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "古城区"}
				}
			},
			"08": {
				"name": "思茅市",
				"content": {
					"21": {"name": "普洱哈尼族彝族自治县"},
					"22": {"name": "墨江哈尼族自治县"},
					"23": {"name": "景东彝族自治县"},
					"24": {"name": "景谷傣族彝族自治县"},
					"25": {"name": "镇沅彝族哈尼族拉祜族自治县"},
					"26": {"name": "江城哈尼族彝族自治县"},
					"27": {"name": "孟连傣族拉祜族佤族自治县"},
					"28": {"name": "澜沧拉祜族自治县"},
					"29": {"name": "西盟佤族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "翠云区"}
				}
			},
			"09": {
				"name": "临沧市",
				"content": {
					"21": {"name": "凤庆县"},
					"22": {"name": "云　县"},
					"23": {"name": "永德县"},
					"24": {"name": "镇康县"},
					"25": {"name": "双江拉祜族佤族布朗族傣族自治县"},
					"26": {"name": "耿马傣族佤族自治县"},
					"27": {"name": "沧源佤族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "临翔区"}
				}
			}
		}
	},
	"54": {
		"name": "西藏省",
		"content": {
			"21": {
				"name": "昌都地区",
				"content": {
					"21": {"name": "昌都县"},
					"22": {"name": "江达县"},
					"23": {"name": "贡觉县"},
					"24": {"name": "类乌齐县"},
					"25": {"name": "丁青县"},
					"26": {"name": "察雅县"},
					"27": {"name": "八宿县"},
					"28": {"name": "左贡县"},
					"29": {"name": "芒康县"},
					"32": {"name": "洛隆县"},
					"33": {"name": "边坝县"}
				}
			},
			"22": {
				"name": "山南地区",
				"content": {
					"21": {"name": "乃东县"},
					"22": {"name": "扎囊县"},
					"23": {"name": "贡嘎县"},
					"24": {"name": "桑日县"},
					"25": {"name": "琼结县"},
					"26": {"name": "曲松县"},
					"27": {"name": "措美县"},
					"28": {"name": "洛扎县"},
					"29": {"name": "加查县"},
					"31": {"name": "隆子县"},
					"32": {"name": "错那县"},
					"33": {"name": "浪卡子县"}
				}
			},
			"23": {
				"name": "日喀则地区",
				"content": {
					"22": {"name": "南木林县"},
					"23": {"name": "江孜县"},
					"24": {"name": "定日县"},
					"25": {"name": "萨迦县"},
					"26": {"name": "拉孜县"},
					"27": {"name": "昂仁县"},
					"28": {"name": "谢通门县"},
					"29": {"name": "白朗县"},
					"30": {"name": "仁布县"},
					"31": {"name": "康马县"},
					"32": {"name": "定结县"},
					"33": {"name": "仲巴县"},
					"34": {"name": "亚东县"},
					"35": {"name": "吉隆县"},
					"36": {"name": "聂拉木县"},
					"37": {"name": "萨嘎县"},
					"38": {"name": "岗巴县"},
					"01": {"name": "日喀则市"}
				}
			},
			"24": {
				"name": "那曲地区",
				"content": {
					"21": {"name": "那曲县"},
					"22": {"name": "嘉黎县"},
					"23": {"name": "比如县"},
					"24": {"name": "聂荣县"},
					"25": {"name": "安多县"},
					"26": {"name": "申扎县"},
					"27": {"name": "索　县"},
					"28": {"name": "班戈县"},
					"29": {"name": "巴青县"},
					"30": {"name": "尼玛县"}
				}
			},
			"25": {
				"name": "阿里地区",
				"content": {
					"21": {"name": "普兰县"},
					"22": {"name": "札达县"},
					"23": {"name": "噶尔县"},
					"24": {"name": "日土县"},
					"25": {"name": "革吉县"},
					"26": {"name": "改则县"},
					"27": {"name": "措勤县"}
				}
			},
			"26": {
				"name": "林芝地区",
				"content": {
					"21": {"name": "林芝县"},
					"22": {"name": "工布江达县"},
					"23": {"name": "米林县"},
					"24": {"name": "墨脱县"},
					"25": {"name": "波密县"},
					"26": {"name": "察隅县"},
					"27": {"name": "朗　县"}
				}
			},
			"01": {
				"name": "拉萨市",
				"content": {
					"21": {"name": "林周县"},
					"22": {"name": "当雄县"},
					"23": {"name": "尼木县"},
					"24": {"name": "曲水县"},
					"25": {"name": "堆龙德庆县"},
					"26": {"name": "达孜县"},
					"27": {"name": "墨竹工卡县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城关区"}
				}
			}
		}
	},
	"61": {
		"name": "陕西省",
		"content": {
			"10": {
				"name": "商洛市",
				"content": {
					"21": {"name": "洛南县"},
					"22": {"name": "丹凤县"},
					"23": {"name": "商南县"},
					"24": {"name": "山阳县"},
					"25": {"name": "镇安县"},
					"26": {"name": "柞水县"},
					"01": {"name": "市辖区"},
					"02": {"name": "商州区"}
				}
			},
			"01": {
				"name": "西安市",
				"content": {
					"11": {"name": "灞桥区"},
					"12": {"name": "未央区"},
					"13": {"name": "雁塔区"},
					"14": {"name": "阎良区"},
					"15": {"name": "临潼区"},
					"16": {"name": "长安区"},
					"22": {"name": "蓝田县"},
					"24": {"name": "周至县"},
					"25": {"name": "户　县"},
					"26": {"name": "高陵县"},
					"01": {"name": "市辖区"},
					"02": {"name": "新城区"},
					"03": {"name": "碑林区"},
					"04": {"name": "莲湖区"}
				}
			},
			"02": {
				"name": "铜川市",
				"content": {
					"22": {"name": "宜君县"},
					"01": {"name": "市辖区"},
					"02": {"name": "王益区"},
					"03": {"name": "印台区"},
					"04": {"name": "耀州区"}
				}
			},
			"03": {
				"name": "宝鸡市",
				"content": {
					"22": {"name": "凤翔县"},
					"23": {"name": "岐山县"},
					"24": {"name": "扶风县"},
					"26": {"name": "眉　县"},
					"27": {"name": "陇　县"},
					"28": {"name": "千阳县"},
					"29": {"name": "麟游县"},
					"30": {"name": "凤　县"},
					"31": {"name": "太白县"},
					"01": {"name": "市辖区"},
					"02": {"name": "渭滨区"},
					"03": {"name": "金台区"},
					"04": {"name": "陈仓区"}
				}
			},
			"04": {
				"name": "咸阳市",
				"content": {
					"22": {"name": "三原县"},
					"23": {"name": "泾阳县"},
					"24": {"name": "乾　县"},
					"25": {"name": "礼泉县"},
					"26": {"name": "永寿县"},
					"27": {"name": "彬　县"},
					"28": {"name": "长武县"},
					"29": {"name": "旬邑县"},
					"30": {"name": "淳化县"},
					"31": {"name": "武功县"},
					"81": {"name": "兴平市"},
					"01": {"name": "市辖区"},
					"02": {"name": "秦都区"},
					"03": {"name": "杨凌区"},
					"04": {"name": "渭城区"}
				}
			},
			"05": {
				"name": "渭南市",
				"content": {
					"21": {"name": "华　县"},
					"22": {"name": "潼关县"},
					"23": {"name": "大荔县"},
					"24": {"name": "合阳县"},
					"25": {"name": "澄城县"},
					"26": {"name": "蒲城县"},
					"27": {"name": "白水县"},
					"28": {"name": "富平县"},
					"81": {"name": "韩城市"},
					"82": {"name": "华阴市"},
					"01": {"name": "市辖区"},
					"02": {"name": "临渭区"}
				}
			},
			"06": {
				"name": "延安市",
				"content": {
					"21": {"name": "延长县"},
					"22": {"name": "延川县"},
					"23": {"name": "子长县"},
					"24": {"name": "安塞县"},
					"25": {"name": "志丹县"},
					"26": {"name": "吴旗县"},
					"27": {"name": "甘泉县"},
					"28": {"name": "富　县"},
					"29": {"name": "洛川县"},
					"30": {"name": "宜川县"},
					"31": {"name": "黄龙县"},
					"32": {"name": "黄陵县"},
					"01": {"name": "市辖区"},
					"02": {"name": "宝塔区"}
				}
			},
			"07": {
				"name": "汉中市",
				"content": {
					"21": {"name": "南郑县"},
					"22": {"name": "城固县"},
					"23": {"name": "洋　县"},
					"24": {"name": "西乡县"},
					"25": {"name": "勉　县"},
					"26": {"name": "宁强县"},
					"27": {"name": "略阳县"},
					"28": {"name": "镇巴县"},
					"29": {"name": "留坝县"},
					"30": {"name": "佛坪县"},
					"01": {"name": "市辖区"},
					"02": {"name": "汉台区"}
				}
			},
			"08": {
				"name": "榆林市",
				"content": {
					"21": {"name": "神木县"},
					"22": {"name": "府谷县"},
					"23": {"name": "横山县"},
					"24": {"name": "靖边县"},
					"25": {"name": "定边县"},
					"26": {"name": "绥德县"},
					"27": {"name": "米脂县"},
					"28": {"name": "佳　县"},
					"29": {"name": "吴堡县"},
					"30": {"name": "清涧县"},
					"31": {"name": "子洲县"},
					"01": {"name": "市辖区"},
					"02": {"name": "榆阳区"}
				}
			},
			"09": {
				"name": "安康市",
				"content": {
					"21": {"name": "汉阴县"},
					"22": {"name": "石泉县"},
					"23": {"name": "宁陕县"},
					"24": {"name": "紫阳县"},
					"25": {"name": "岚皋县"},
					"26": {"name": "平利县"},
					"27": {"name": "镇坪县"},
					"28": {"name": "旬阳县"},
					"29": {"name": "白河县"},
					"01": {"name": "市辖区"},
					"02": {"name": "汉滨区"}
				}
			}
		}
	},
	"62": {
		"name": "甘肃省",
		"content": {
			"10": {
				"name": "庆阳市",
				"content": {
					"21": {"name": "庆城县"},
					"22": {"name": "环　县"},
					"23": {"name": "华池县"},
					"24": {"name": "合水县"},
					"25": {"name": "正宁县"},
					"26": {"name": "宁　县"},
					"27": {"name": "镇原县"},
					"01": {"name": "市辖区"},
					"02": {"name": "西峰区"}
				}
			},
			"11": {
				"name": "定西市",
				"content": {
					"21": {"name": "通渭县"},
					"22": {"name": "陇西县"},
					"23": {"name": "渭源县"},
					"24": {"name": "临洮县"},
					"25": {"name": "漳　县"},
					"26": {"name": "岷　县"},
					"01": {"name": "市辖区"},
					"02": {"name": "安定区"}
				}
			},
			"12": {
				"name": "陇南市",
				"content": {
					"21": {"name": "成　县"},
					"22": {"name": "文　县"},
					"23": {"name": "宕昌县"},
					"24": {"name": "康　县"},
					"25": {"name": "西和县"},
					"26": {"name": "礼　县"},
					"27": {"name": "徽　县"},
					"28": {"name": "两当县"},
					"01": {"name": "市辖区"},
					"02": {"name": "武都区"}
				}
			},
			"29": {
				"name": "临夏回族自治州",
				"content": {
					"21": {"name": "临夏县"},
					"22": {"name": "康乐县"},
					"23": {"name": "永靖县"},
					"24": {"name": "广河县"},
					"25": {"name": "和政县"},
					"26": {"name": "东乡族自治县"},
					"27": {"name": "积石山保安族东乡族撒拉族自治县"},
					"01": {"name": "临夏市"}
				}
			},
			"30": {
				"name": "甘南藏族自治州",
				"content": {
					"21": {"name": "临潭县"},
					"22": {"name": "卓尼县"},
					"23": {"name": "舟曲县"},
					"24": {"name": "迭部县"},
					"25": {"name": "玛曲县"},
					"26": {"name": "碌曲县"},
					"27": {"name": "夏河县"},
					"01": {"name": "合作市"}
				}
			},
			"01": {
				"name": "兰州市",
				"content": {
					"11": {"name": "红古区"},
					"21": {"name": "永登县"},
					"22": {"name": "皋兰县"},
					"23": {"name": "榆中县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城关区"},
					"03": {"name": "七里河区"},
					"04": {"name": "西固区"},
					"05": {"name": "安宁区"}
				}
			},
			"02": {"name": "嘉峪关市", "content": {"01": {"name": "市辖区"}}},
			"03": {"name": "金昌市", "content": {"21": {"name": "永昌县"}, "01": {"name": "市辖区"}, "02": {"name": "金川区"}}},
			"04": {
				"name": "白银市",
				"content": {
					"21": {"name": "靖远县"},
					"22": {"name": "会宁县"},
					"23": {"name": "景泰县"},
					"01": {"name": "市辖区"},
					"02": {"name": "白银区"},
					"03": {"name": "平川区"}
				}
			},
			"05": {
				"name": "天水市",
				"content": {
					"21": {"name": "清水县"},
					"22": {"name": "秦安县"},
					"23": {"name": "甘谷县"},
					"24": {"name": "武山县"},
					"25": {"name": "张家川回族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "秦城区"},
					"03": {"name": "北道区"}
				}
			},
			"06": {
				"name": "武威市",
				"content": {
					"21": {"name": "民勤县"},
					"22": {"name": "古浪县"},
					"23": {"name": "天祝藏族自治县"},
					"01": {"name": "市辖区"},
					"02": {"name": "凉州区"}
				}
			},
			"07": {
				"name": "张掖市",
				"content": {
					"21": {"name": "肃南裕固族自治县"},
					"22": {"name": "民乐县"},
					"23": {"name": "临泽县"},
					"24": {"name": "高台县"},
					"25": {"name": "山丹县"},
					"01": {"name": "市辖区"},
					"02": {"name": "甘州区"}
				}
			},
			"08": {
				"name": "平凉市",
				"content": {
					"21": {"name": "泾川县"},
					"22": {"name": "灵台县"},
					"23": {"name": "崇信县"},
					"24": {"name": "华亭县"},
					"25": {"name": "庄浪县"},
					"26": {"name": "静宁县"},
					"01": {"name": "市辖区"},
					"02": {"name": "崆峒区"}
				}
			},
			"09": {
				"name": "酒泉市",
				"content": {
					"21": {"name": "金塔县"},
					"22": {"name": "安西县"},
					"23": {"name": "肃北蒙古族自治县"},
					"24": {"name": "阿克塞哈萨克族自治县"},
					"81": {"name": "玉门市"},
					"82": {"name": "敦煌市"},
					"01": {"name": "市辖区"},
					"02": {"name": "肃州区"}
				}
			}
		}
	},
	"63": {
		"name": "青海省",
		"content": {
			"21": {
				"name": "海东地区",
				"content": {
					"21": {"name": "平安县"},
					"22": {"name": "民和回族土族自治县"},
					"23": {"name": "乐都县"},
					"26": {"name": "互助土族自治县"},
					"27": {"name": "化隆回族自治县"},
					"28": {"name": "循化撒拉族自治县"}
				}
			},
			"22": {
				"name": "海北藏族自治州",
				"content": {"21": {"name": "门源回族自治县"}, "22": {"name": "祁连县"}, "23": {"name": "海晏县"}, "24": {"name": "刚察县"}}
			},
			"23": {
				"name": "黄南藏族自治州",
				"content": {"21": {"name": "同仁县"}, "22": {"name": "尖扎县"}, "23": {"name": "泽库县"}, "24": {"name": "河南蒙古族自治县"}}
			},
			"25": {
				"name": "海南藏族自治州",
				"content": {
					"21": {"name": "共和县"},
					"22": {"name": "同德县"},
					"23": {"name": "贵德县"},
					"24": {"name": "兴海县"},
					"25": {"name": "贵南县"}
				}
			},
			"26": {
				"name": "果洛藏族自治州",
				"content": {
					"21": {"name": "玛沁县"},
					"22": {"name": "班玛县"},
					"23": {"name": "甘德县"},
					"24": {"name": "达日县"},
					"25": {"name": "久治县"},
					"26": {"name": "玛多县"}
				}
			},
			"27": {
				"name": "玉树藏族自治州",
				"content": {
					"21": {"name": "玉树县"},
					"22": {"name": "杂多县"},
					"23": {"name": "称多县"},
					"24": {"name": "治多县"},
					"25": {"name": "囊谦县"},
					"26": {"name": "曲麻莱县"}
				}
			},
			"28": {
				"name": "海西蒙古族藏族自治州",
				"content": {
					"21": {"name": "乌兰县"},
					"22": {"name": "都兰县"},
					"23": {"name": "天峻县"},
					"01": {"name": "格尔木市"},
					"02": {"name": "德令哈市"}
				}
			},
			"01": {
				"name": "西宁市",
				"content": {
					"21": {"name": "大通回族土族自治县"},
					"22": {"name": "湟中县"},
					"23": {"name": "湟源县"},
					"01": {"name": "市辖区"},
					"02": {"name": "城东区"},
					"03": {"name": "城中区"},
					"04": {"name": "城西区"},
					"05": {"name": "城北区"}
				}
			}
		}
	},
	"64": {
		"name": "宁夏省",
		"content": {
			"01": {
				"name": "银川市",
				"content": {
					"21": {"name": "永宁县"},
					"22": {"name": "贺兰县"},
					"81": {"name": "灵武市"},
					"01": {"name": "市辖区"},
					"04": {"name": "兴庆区"},
					"05": {"name": "西夏区"},
					"06": {"name": "金凤区"}
				}
			},
			"02": {
				"name": "石嘴山市",
				"content": {"21": {"name": "平罗县"}, "01": {"name": "市辖区"}, "02": {"name": "大武口区"}, "05": {"name": "惠农区"}}
			},
			"03": {
				"name": "吴忠市",
				"content": {
					"23": {"name": "盐池县"},
					"24": {"name": "同心县"},
					"81": {"name": "青铜峡市"},
					"01": {"name": "市辖区"},
					"02": {"name": "利通区"}
				}
			},
			"04": {
				"name": "固原市",
				"content": {
					"22": {"name": "西吉县"},
					"23": {"name": "隆德县"},
					"24": {"name": "泾源县"},
					"25": {"name": "彭阳县"},
					"01": {"name": "市辖区"},
					"02": {"name": "原州区"}
				}
			},
			"05": {
				"name": "中卫市",
				"content": {"21": {"name": "中宁县"}, "22": {"name": "海原县"}, "01": {"name": "市辖区"}, "02": {"name": "沙坡头区"}}
			}
		}
	},
	"65": {
		"name": "新疆省",
		"content": {
			"21": {
				"name": "吐鲁番地区",
				"content": {"22": {"name": "鄯善县"}, "23": {"name": "托克逊县"}, "01": {"name": "吐鲁番市"}}
			},
			"22": {"name": "哈密地区", "content": {"22": {"name": "巴里坤哈萨克自治县"}, "23": {"name": "伊吾县"}, "01": {"name": "哈密市"}}},
			"23": {
				"name": "昌吉回族自治州",
				"content": {
					"23": {"name": "呼图壁县"},
					"24": {"name": "玛纳斯县"},
					"25": {"name": "奇台县"},
					"27": {"name": "吉木萨尔县"},
					"28": {"name": "木垒哈萨克自治县"},
					"01": {"name": "昌吉市"},
					"02": {"name": "阜康市"},
					"03": {"name": "米泉市"}
				}
			},
			"27": {"name": "博尔塔拉蒙古自治州", "content": {"22": {"name": "精河县"}, "23": {"name": "温泉县"}, "01": {"name": "博乐市"}}},
			"28": {
				"name": "巴音郭楞蒙古自治州",
				"content": {
					"22": {"name": "轮台县"},
					"23": {"name": "尉犁县"},
					"24": {"name": "若羌县"},
					"25": {"name": "且末县"},
					"26": {"name": "焉耆回族自治县"},
					"27": {"name": "和静县"},
					"28": {"name": "和硕县"},
					"29": {"name": "博湖县"},
					"01": {"name": "库尔勒市"}
				}
			},
			"29": {
				"name": "阿克苏地区",
				"content": {
					"22": {"name": "温宿县"},
					"23": {"name": "库车县"},
					"24": {"name": "沙雅县"},
					"25": {"name": "新和县"},
					"26": {"name": "拜城县"},
					"27": {"name": "乌什县"},
					"28": {"name": "阿瓦提县"},
					"29": {"name": "柯坪县"},
					"01": {"name": "阿克苏市"}
				}
			},
			"30": {
				"name": "克孜勒苏柯尔克孜自治州",
				"content": {"22": {"name": "阿克陶县"}, "23": {"name": "阿合奇县"}, "24": {"name": "乌恰县"}, "01": {"name": "阿图什市"}}
			},
			"31": {
				"name": "喀什地区",
				"content": {
					"21": {"name": "疏附县"},
					"22": {"name": "疏勒县"},
					"23": {"name": "英吉沙县"},
					"24": {"name": "泽普县"},
					"25": {"name": "莎车县"},
					"26": {"name": "叶城县"},
					"27": {"name": "麦盖提县"},
					"28": {"name": "岳普湖县"},
					"29": {"name": "伽师县"},
					"30": {"name": "巴楚县"},
					"31": {"name": "塔什库尔干塔吉克自治县"},
					"01": {"name": "喀什市"}
				}
			},
			"32": {
				"name": "和田地区",
				"content": {
					"21": {"name": "和田县"},
					"22": {"name": "墨玉县"},
					"23": {"name": "皮山县"},
					"24": {"name": "洛浦县"},
					"25": {"name": "策勒县"},
					"26": {"name": "于田县"},
					"27": {"name": "民丰县"},
					"01": {"name": "和田市"}
				}
			},
			"40": {
				"name": "伊犁哈萨克自治州",
				"content": {
					"21": {"name": "伊宁县"},
					"22": {"name": "察布查尔锡伯自治县"},
					"23": {"name": "霍城县"},
					"24": {"name": "巩留县"},
					"25": {"name": "新源县"},
					"26": {"name": "昭苏县"},
					"27": {"name": "特克斯县"},
					"28": {"name": "尼勒克县"},
					"02": {"name": "伊宁市"},
					"03": {"name": "奎屯市"}
				}
			},
			"42": {
				"name": "塔城地区",
				"content": {
					"21": {"name": "额敏县"},
					"23": {"name": "沙湾县"},
					"24": {"name": "托里县"},
					"25": {"name": "裕民县"},
					"26": {"name": "和布克赛尔蒙古自治县"},
					"01": {"name": "塔城市"},
					"02": {"name": "乌苏市"}
				}
			},
			"43": {
				"name": "阿勒泰地区",
				"content": {
					"21": {"name": "布尔津县"},
					"22": {"name": "富蕴县"},
					"23": {"name": "福海县"},
					"24": {"name": "哈巴河县"},
					"25": {"name": "青河县"},
					"26": {"name": "吉木乃县"},
					"01": {"name": "阿勒泰市"}
				}
			},
			"90": {
				"name": "省直辖行政单位",
				"content": {"01": {"name": "石河子市"}, "02": {"name": "阿拉尔市"}, "03": {"name": "图木舒克市"}, "04": {"name": "五家渠市"}}
			},
			"01": {
				"name": "乌鲁木齐市",
				"content": {
					"21": {"name": "乌鲁木齐县"},
					"01": {"name": "市辖区"},
					"02": {"name": "天山区"},
					"03": {"name": "沙依巴克区"},
					"04": {"name": "新市区"},
					"05": {"name": "水磨沟区"},
					"06": {"name": "头屯河区"},
					"07": {"name": "达坂城区"},
					"08": {"name": "东山区"}
				}
			},
			"02": {
				"name": "克拉玛依市",
				"content": {
					"01": {"name": "市辖区"},
					"02": {"name": "独山子区"},
					"03": {"name": "克拉玛依区"},
					"04": {"name": "白碱滩区"},
					"05": {"name": "乌尔禾区"}
				}
			}
		}
	}
}

window.captureScreen = function (node, size, cb) {
	if (arguments.length === 2 && typeof size === 'function') {
		cb = size;
		size = null;
	}

	if (cc.sys.isNative) {
		size = size || cc.director.getVisibleSize();

		var renderTexture = cc.RenderTexture.create(size.width, size.height, cc.Texture2D.PIXEL_FORMAT_RGBA8888, gl.DEPTH24_STENCIL8_OES);
		//把 renderTexture 添加到场景中去，否则截屏的时候，场景中的元素会移动
		cc.director.getScene()._sgNode.addChild(renderTexture);
		//把 renderTexture 设置为不可见，可以避免截图成功后，移除 renderTexture 造成的闪烁
		renderTexture.setVisible(false);
		renderTexture.begin();
		node._sgNode.visit();
		renderTexture.end();

		renderTexture.saveToFile("demo.png", cc.ImageFormat.PNG, true, function () {
			cc.log("capture screen successfully!:", jsb.fileUtils.getWritablePath());
			renderTexture.removeFromParent();
			cb(null, jsb.fileUtils.getWritablePath() + '/demo.png');
		});
	}
}

window.checkPhone = function (phone) {
	if (!(/^1[3|4|5|7|8]\d{9}$/.test(phone))) {
		return false;
	}
	return true;
}

// //是否中文（也包含日文和韩文）
window.isChineseChar = function (str) {
	var reg = /^[\u4E00-\u9FA5\uF900-\uFA2D]*$/g;
	return reg.test(str);
}

window.isIdCard = function (cardid) {
	// 身份证正则表达式(18位)

	var isIdCard2 = /^[1-9]\d{5}(19\d{2}|[2-9]\d{3})((0\d)|(1[0-2]))(([0|1|2]\d)|3[0-1])(\d{4}|\d{3}X)$/i;
	var stard = "10X98765432"; //最后一位身份证的号码
	var first = [7, 9, 10, 5, 8, 4, 2, 1, 6, 3, 7, 9, 10, 5, 8, 4, 2]; //1-17系数

	var sum = 0;
	if (!isIdCard2.test(cardid)) {
		return false;
	}

	var year = cardid.substr(6, 4);
	var month = cardid.substr(10, 2);
	var day = cardid.substr(12, 2);
	var birthday = cardid.substr(6, 8);

	if (birthday != dataToString(new Date(year + '/' + month + '/' + day))) {

		return false;
	}

	for (var i = 0; i < cardid.length - 1; i++) {
		sum += cardid[i] * first[i];
	}

	var result = sum % 11;
	var last = stard[result];   // 计算出来的最后一位身份证号码
	if (cardid[cardid.length - 1].toUpperCase() == last) {
		return true;
	} else {
		cc.log("最后一位")
		return false;
	}
}

//日期转字符串 返回日期格式20080808
window.dataToString = function (date) {
	if (date instanceof Date) {
		var year = date.getFullYear();
		var month = date.getMonth() + 1;
		month = month < 10 ? '0' + month : month;
		var day = date.getDate();
		day = day < 10 ? '0' + day : day
		return '' + year + month + day;
	}
	return '';
}

// 是否是合法的url
window.isUrl = function (str) {
	var reg = /(http|https)?:\/\/[^\s]+$/;
	return reg.test(str);
}

// 缩短显示的长度如：10000 == 1万
window.formatNum = function (num) {
	var result = num.toString();
	var flag = 0;
	//超过1亿
	if (num > 100000000) {
		flag = 1;
		result = (num / 100000000).toFixed(2).toString();
	} else if (num > 10000) {
		flag = 2;
		result = (num / 10000).toFixed(2).toString();
	}

	// 如果尾数为零则删去
	var len = result.length;
	if (result[len - 3] == '.' && result[len - 1] == '0') {
		if (result[len - 2] == 0) {
			result = result.substr(0, len - 3);
		} else {
			result = result.substr(0, len - 1);
		}
	}

	if (flag == 1) {
		result += '亿';
	} else if (flag == 2) {
		result += '万';
	}
	return result;
}

/**
 * min max 之间随机取一个数
 * @param min
 * @param max
 */
window.random = function (min, max) {
	if (max == null) {
		max = min;
		min = 0;
	}

	return min + Math.floor(Math.random() * (max - min));
}

/**
 * 数组随机排序
 * @param arrays
 * @returns {Array}
 */
window.shuffle = function (arrays) {
	var len = arrays.length;
	if (!len) {
		return [];
	}
	var arr = Array(len);
	for (var index = 0, rand; index < len; index++) {
		rand = random(0, index);
		if (rand !== index) {
			arr[index] = arr[rand];
		}
		arr[rand] = arrays[index];
	}
	return arr;
}

// 截取合适的名字长度
window.formatName = function (str, num) {
	var result = '';
	var len = 0;
	num = num || 6;  // 默认6位
	for (var index = 0; index < str.length; ++index) {
		// 加上下个字符宽度超出范围则结束
		if (len >= num - 1 || isChineseChar(str[index + 1])) {
			if (len + 2 > num) {
				result += '...';
				break;
			}
		}
		result += str[index];
		isChineseChar(str[index]) ? len += 2 : len += 1;
	}
	return result;
}
/**
 * 获取时间戳
 * @returns {number}
 */
window.getTimestamp = function () {
	return Date.parse(new Date()) / 1000;
}