// const data = {
//     chatData:  ["快点啦，人呢掉厕所里去啦","不好意思等我一下","打来碰一下","有没有吃的啦","哼，你这个牌打的真臭"
//         ,"算了，算了这盘玩好不来了","今天风头好，把你们赢光","我是佩服你，你自己一个人玩好了"],
//     lookAnimData:[3,4,8,4,2,3,4,1,1,3,1,3,1,2,8,3,2,3,1,3],
// }
const data = {
    chatData:  ["等一下，我看下牌",
        "有没有的碰啊，粘在哪里干嘛",
        "喂猪啊，地摊放满了",
        "算数，这盘超掉解树",
        "底下有人的，弄张吃下",
        "个接死吃死碰的啊",
        "家里没米了是不是，这种牌都拿来胡",
        "让你飞死啊。",
        "你一个人胡去胡去，难不难为情的",
        "上碰下自摸",
        "少吃点嘞，吃吃掉财神个",
    ],
    lookAnimData:[3,4,8,4,2,3,4,1,1,3,1,3,1,2,8,3,2,3,1,3],
}
module.exports = Object.freeze(data);
